{
  "backend/main.mo": "Motoko canister managing supporter requests, supporter approvals, revocations, and user profile storage with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for many frontend source files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling rules.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, theme provider, age gate, and global layout using TanStack Router.",
  "frontend/src/components/AgeGate.tsx": "Age‑verification component enforcing 18+ confirmation and blocking access until accepted.",
  "frontend/src/components/AuthControls.tsx": "Provides sign‑in UI, profile navigation, and admin-claim logic using Internet Identity and actor hooks.",
  "frontend/src/components/community/LinkifiedText.tsx": "Converts text into link and video tokens and renders them with safe, styled output.",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Displays and manages the moderation queue, allowing admins to approve or reject flagged posts.",
  "frontend/src/components/community/PollCard.tsx": "Shows an individual poll with voting UI, results, and supporter badge logic.",
  "frontend/src/components/community/PollsSection.tsx": "Lists existing polls and provides a form for authenticated users to create new polls.",
  "frontend/src/components/community/PostActions.tsx": "Provides edit/delete UI for posts using dialogs, managing local form state and calling edit/delete callbacks.",
  "frontend/src/components/community/PostComments.tsx": "Loads and displays comments with error handling, supports adding new comments, and toggles comment visibility.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Converts image bytes to a blob URL and renders an attached post image.",
  "frontend/src/components/community/PostLikeButton.tsx": "Displays like count and toggles like/unlike actions with backend error handling.",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Renders a video attachment using a direct streaming URL from an ExternalBlob.",
  "frontend/src/components/community/VideoEmbed.tsx": "Shows a responsive 16:9 iframe embed for approved video providers.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Fullscreen media lightbox with navigation, keyboard controls, favorites toggle, and storybook support.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Dialog for uploading gallery media with validation, progress tracking, and submission to backend.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with header, navigation, footer, and routed content outlet.",
  "frontend/src/components/LoadingState.tsx": "Renders a centered loading spinner with an optional message.",
  "frontend/src/components/Nav.tsx": "Implements desktop and mobile navigation menus with active‑link highlighting.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Provides an avatar upload UI with image validation, previews, and blob conversion for profile avatars.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Renders a full profile editing panel allowing users to modify display info, avatar, links, plushie images, and visibility settings.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Handles multi-image upload, preview management, validation, and removal for plushie gallery images.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a responsive grid of profile plushie images using direct URLs from stored blobs.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Shows a list of external profile links with safe URL handling and basic styling.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "Renders a decorative supporter badge with a heart icon and gradient background.",
  "frontend/src/content/articles.ts": "Defines the Article interface and exports static article data for the site's content system.",
  "frontend/src/content/events.ts": "Placeholder content file for events with no data defined.",
  "frontend/src/content/teddyStorybook.ts": "Exports metadata and story content for a Teddy-themed storybook entry.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useGalleryFavorites.ts": "Manages a localStorage-backed favorite IDs set with helpers for checking and toggling favorites.",
  "frontend/src/hooks/useGalleryMediaQueries.ts": "React-query hooks for listing and adding gallery media items using the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useProfileQueries.ts": "React-query hooks for fetching and updating user profiles, including directory and caller-specific profiles.",
  "frontend/src/hooks/useQueries.ts": "General backend query/mutation hooks for posts, moderation, and admin checks using the actor API.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Hook that checks whether a static asset URL is reachable via a HEAD/GET strategy.",
  "frontend/src/hooks/useSupporterQueries.ts": "Hooks for querying supporters, supporter requests, and submitting/approving supporter actions.",
  "frontend/src/index.css": "Tailwind CSS setup defining light-themed color variables and base styles.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Static about page presenting mission, values, offerings, and community guidelines using card components.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Displays a grid of adult pacifier brands with descriptions and specialties, plus an informational section.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Renders a full article based on slug, including metadata, content, and a not-found state.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles in card format with category, read time, summary, and links to details.",
  "frontend/src/pages/ColoringPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements the community board with post creation, media uploads, moderation, and post interactions.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form and email copy tool for users to reach the site administrators.",
  "frontend/src/pages/EventsPage.tsx": "Allows users to view and create events, handling validation, backend errors, and event formatting.",
  "frontend/src/pages/GalleryPage.tsx": "Implements a searchable, filterable gallery with favorites, uploads, and a lightbox viewer with navigation and authentication prompts.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with a hero section, calls to action, and featured content sections using responsive design.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Displays a grid of curated plushie brands with descriptions and specialties, plus an informational section about the list.",
  "frontend/src/pages/ProfilePage.tsx": "Shows an individual user profile with follow/like actions, edit mode, and image/link sections, handling loading and error states.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Lists public user profiles in a grid with avatars and bios, including loading, error, and empty states.",
  "frontend/src/pages/SupportPage.tsx": "React page for submitting, viewing, approving, and revoking supporter requests with admin controls and error handling.",
  "frontend/src/utils/actorError.ts": "Utility for normalizing backend errors into readable messages with special handling for authorization, moderation, and canister issues.",
  "frontend/src/utils/galleryMedia.ts": "Defines gallery item types and utilities for converting backend items, merging static and uploaded media, and filtering by search.",
  "frontend/src/utils/imageAttachment.ts": "Helpers for validating, reading, and formatting image files for uploads with size/type checks.",
  "frontend/src/utils/linkifyText.ts": "Parses text into link, video, and plain-text tokens by detecting URLs and video embeds.",
  "frontend/src/utils/profileImages.ts": "Utilities for converting files to blobs, creating preview URLs, and retrieving blob direct URLs for profile images.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks if a static asset is reachable using HEAD with GET fallback and error handling.",
  "frontend/src/utils/urlParams.ts": "Functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/videoAttachment.ts": "Provides accepted video MIME types, a 100MB size limit, helpers to format file sizes, and a validator for uploaded video files.",
  "frontend/src/utils/videoEmbeds.ts": "Detects YouTube and Vimeo URLs and returns normalized embed descriptors with provider, embed URL, and video ID.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, container settings, animations, and plugin usage.",
  "project_state.json": "Tracks project state, required profile-system fixes, and a planned teddy-themed storybook gallery item."
}