{
  "backend/main.mo": "Main backend actor that integrates access control and blob storage mixins, manages supporter requests/approvals with time-based validity, and handles user profiles with display names, bios, avatars, links, and plushie images.",
  "feature_evidence.json": "Feature evidence report documenting the addition of a Figma site navigation link in the Nav component with high confidence, listing affected files and components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and content, detailing routing, authentication, gallery, community board, events, articles, and admin functionality with backend integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for backgrounds, foregrounds, borders, charts, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point for the Plushie Haven application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, theme provider, age gate, session timeout warning, and routes for home, articles, events, profiles, admin pages, and role-guarded admin routes.",
  "frontend/src/components/AgeGate.tsx": "Age verification component that checks localStorage for 18+ confirmation, displays a modal dialog on first visit, and blocks access if the user declines.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denied screen showing error message based on authentication status and role, with navigation options to sign in or return home.",
  "frontend/src/components/auth/RoleGuard.tsx": "Role-based route guard that checks user permissions against required role using hierarchy (guest < user < admin) and shows AccessDeniedScreen if unauthorized.",
  "frontend/src/components/AuthControls.tsx": "Authentication controls dropdown displaying user identity, role badge, profile navigation, admin claim functionality with actor connection checks, and logout with cache clearing.",
  "frontend/src/components/community/LinkifiedText.tsx": "Empty file (no content).",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Empty file (no content).",
  "frontend/src/components/community/PollCard.tsx": "Empty file (no content).",
  "frontend/src/components/community/PollsSection.tsx": "Empty file (no content).",
  "frontend/src/components/community/PostActions.tsx": "Empty file (no content).",
  "frontend/src/components/community/PostComments.tsx": "Empty file (no content).",
  "frontend/src/components/community/PostImageAttachment.tsx": "Empty file (no content).",
  "frontend/src/components/community/PostLikeButton.tsx": "Empty file (no content).",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Empty file (no content).",
  "frontend/src/components/community/VideoEmbed.tsx": "Empty file (no content).",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Empty file (no content).",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Empty file (no content).",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo, navigation, and auth controls, plus a footer with copyright and links. Uses Outlet for nested routing.",
  "frontend/src/components/LoadingState.tsx": "Reusable loading indicator component displaying a spinning Loader2 icon with an optional message.",
  "frontend/src/components/Nav.tsx": "Navigation component with desktop and mobile (Sheet) views, including main nav links, external links (Reflect & Create, Design Inspiration), and admin dropdown menu for admin users.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Avatar upload component with file validation (type, size), preview functionality, and conversion to ExternalBlob format. Supports PNG, JPEG, and WebP images.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Profile editing form with fields for display name, bio, avatar, links, plushie images, and public directory toggle. Handles both profile creation and updates with validation.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "A React component for editing plushie images with upload, preview, and removal functionality. Manages image validation, file-to-blob conversion, and preview URL lifecycle with cleanup.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "A simple React component that displays a grid of plushie images from ExternalBlob objects. Returns null if no images are provided.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "A React component that renders a list of external links with icons and safe URL handling. Returns null if no links are provided.",
  "frontend/src/components/SessionTimeoutWarning.tsx": "Alert dialog that warns users before session timeout and provides a button to extend the session, displaying remaining time in MM:SS format.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "A React component that displays a gradient badge with a heart icon to indicate supporter status.",
  "frontend/src/content/articles.ts": "Defines article data structure and exports an array of educational articles about plushie care, display, and collecting. Contains full article content for each topic.",
  "frontend/src/content/events.ts": "An empty file, likely a placeholder for future event content definitions.",
  "frontend/src/content/teddyStorybook.ts": "Exports a storybook content object containing a children's story about Teddy the bear's forest adventure. Includes title, description, cover image path, and full story text.",
  "frontend/src/hooks/useActor.ts": "A React hook that manages backend actor creation with authentication, handling both anonymous and authenticated states. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAssistantChat.ts": "A React hook for managing chat state with a plushie assistant, including message history, session state, and localStorage persistence. Provides quick action shortcuts and message processing.",
  "frontend/src/hooks/useEventQueries.ts": "Defines React Query hooks for event operations (list and create) with placeholder implementations. Currently returns empty arrays as the backend doesn't support events yet.",
  "frontend/src/hooks/useGalleryFavorites.ts": "An empty file, likely a placeholder for future gallery favorites functionality.",
  "frontend/src/hooks/useGalleryMediaQueries.ts": "An empty file, likely a placeholder for future gallery media query hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation. Provides context for authentication status and operations throughout the app.",
  "frontend/src/hooks/useProfileQueries.ts": "React Query hooks for user profile operations including listing directory profiles, fetching user profiles, following/unfollowing users, and managing follow counts.",
  "frontend/src/hooks/useQueries.ts": "Empty file with no content.",
  "frontend/src/hooks/useSessionTimeout.ts": "Hook that manages automatic session timeout with configurable inactivity period (default 30 minutes), shows warnings before logout, and tracks user activity across multiple event types.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "React Query hook that checks if a static asset is available at a given URL using HEAD/GET fallback strategy with 5-minute caching.",
  "frontend/src/hooks/useSupporterQueries.ts": "React Query hooks for supporter management including fetching supporters, checking supporter status, submitting/approving supporter requests, and revoking supporter access with admin-only operations.",
  "frontend/src/hooks/useUserRole.ts": "Hooks for fetching and checking user roles (guest, user, admin) with permission hierarchy validation and convenience helpers for admin/moderator checks.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette featuring baby blue and pastel pink theme for a cozy plushie aesthetic, with identical light and dark mode styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Static about page describing Plushie Haven's mission, community values, offerings, and guidelines for adult plushie enthusiasts with card-based layout.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page for user management with search interface and role assignment UI, currently showing placeholder content with alert indicating backend implementation is required.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Displays a grid of adult pacifier brands with descriptions, specialties, and badges. Includes a static list of 10 brands with details about their unique features and target markets.",
  "frontend/src/pages/AnalyticsDashboardPage.tsx": "Shows analytics dashboard with metrics for events, supporters, and pending requests. Fetches data from multiple hooks and displays metric cards with icons and descriptions.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays individual article content based on slug parameter. Shows article title, category badge, read time, summary, and full content with back navigation.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles in a grid layout with cards showing category, read time, title, and summary. Each card links to the detailed article page.",
  "frontend/src/pages/AuditLogPage.tsx": "Placeholder page for audit logs with search functionality. Displays alert indicating backend implementation is required for this feature to work.",
  "frontend/src/pages/ColoringPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Empty file with no content.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with email composition and copy-to-clipboard functionality. Allows users to send messages via mailto link or copy the contact email address.",
  "frontend/src/pages/EventsPage.tsx": "Events management page with create event form and event listing. Handles authentication, date/time validation, backend error handling, and displays events with formatted timestamps.",
  "frontend/src/pages/GalleryPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Landing page for Plushie Haven featuring a hero section with logo and tagline, a \"Plushie Moments\" section, and links to explore articles. Includes error handling for hero image loading with fallback display.",
  "frontend/src/pages/ModerationDashboardPage.tsx": "Empty file with no content.",
  "frontend/src/pages/PlushieAssistantPage.tsx": "Chat interface for the \"Plushie Pal Assistant\" AI companion with message history, quick action buttons, send/clear functionality, and auto-scrolling. Uses useAssistantChat hook for state management.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Static informational page displaying a grid of 13 popular plushie brands (Squishmallows, Jellycat, Steiff, etc.) with descriptions and specialty badges. Includes an explanatory section about the curated list.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page supporting viewing own/other profiles, editing mode via query param, follow/unfollow functionality, and profile creation prompts. Handles authentication state and displays profile data including links and images.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Directory listing page showing all public community profiles in a grid layout. Includes empty states for no profiles and error handling, with create profile prompts for authenticated users.",
  "frontend/src/pages/SupportPage.tsx": "React page component for supporter management, allowing users to submit supporter requests and admins to approve/revoke supporters, with external links to Ko-fi and Patreon.",
  "frontend/src/pages/SystemSettingsPage.tsx": "Placeholder admin page for system-wide settings (features, content limits, moderation, session) with a notice that backend implementation is required.",
  "frontend/src/utils/actorError.ts": "Normalizes backend actor errors into user-friendly messages, handling stopped canisters, authorization errors, moderation blocks, and admin claim conflicts.",
  "frontend/src/utils/galleryMedia.ts": "Empty utility file for gallery media handling (no content).",
  "frontend/src/utils/imageAttachment.ts": "Validates image file types (PNG, JPEG, WebP) and size (max 2MB) for profile images and plushie uploads.",
  "frontend/src/utils/inputValidation.ts": "Provides validation functions for text length, usernames, URLs, file uploads, and detects dangerous HTML/script content.",
  "frontend/src/utils/linkifyText.ts": "Empty utility file for text linkification (no content).",
  "frontend/src/utils/plushieAssistant.ts": "Implements a conversational assistant for plushie recommendations and stories, with intent detection, multi-step recommendation flow, care tips, and fun facts.",
  "frontend/src/utils/profileImages.ts": "Converts File objects to Uint8Array and ExternalBlob for profile image uploads, and manages preview URLs for local files.",
  "frontend/src/utils/sanitization.ts": "Provides text sanitization utilities including HTML stripping/escaping, URL protocol validation, whitespace normalization, and safe text display with optional length limits.",
  "frontend/src/utils/staticAssetCheck.ts": "Exports a function to verify static asset availability by attempting HEAD request first, then falling back to aborted GET request if HEAD is unsupported or fails.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/src/utils/videoAttachment.ts": "Empty file with no content.",
  "frontend/src/utils/videoEmbeds.ts": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, font families (Quicksand, Nunito, Inter), custom shadows, border radius variables, and animation keyframes.",
  "project_state.json": "Project state file for \"Plushie Haven\" tracking one existing feature (navigation link to Figma site) and one pending feature request with the same goal."
}