{
  "backend/main.mo": "Motoko canister implementing authorization, blob storage, user profile CRUD with privacy controls, and legacy post/event creation logic. Includes permission checks and maps keyed by principals and IDs.",
  "feature_evidence.json": "Feature evidence report describing frontend admin-claim flow updates and backend bindings updates, listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files describing routing, UI components, pages, hooks, and static content.",
  "frontend/index.css": "Tailwind CSS base file defining theme variables for light and dark modes and applying global background and text styling.",
  "frontend/index.html": "HTML entry file that mounts the React app at #root and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all site routes, wraps the app in ThemeProvider and AgeGate, and renders global toasts.",
  "frontend/src/components/AgeGate.tsx": "Age verification component requiring 18+ confirmation, storing consent in localStorage, and blocking access if declined.",
  "frontend/src/components/AuthControls.tsx": "Authentication dropdown handling login, logout, profile display names, and the admin-claim action with error toasts and query invalidation.",
  "frontend/src/components/community/PostActions.tsx": "Provides edit and delete controls for posts with dialogs for confirmation and form editing.",
  "frontend/src/components/community/PostComments.tsx": "Shows comment count, toggleable comments section, and a form for submitting new comments.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Renders an attached post image by converting raw bytes into a temporary blob URL.",
  "frontend/src/components/community/PostLikeButton.tsx": "Like/unlike button showing like count, handling authentication and mutation states.",
  "frontend/src/components/Layout.tsx": "Main layout component providing header, navigation, routed content area, and footer.",
  "frontend/src/components/LoadingState.tsx": "Displays a centered loading spinner with an optional message.",
  "frontend/src/components/Nav.tsx": "Responsive navigation bar with desktop links and a mobile slide-out menu.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Empty placeholder file.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Empty placeholder file.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Empty placeholder file.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a responsive grid of profile images using direct blob URLs.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Renders a list of external profile links with URL validation.",
  "frontend/src/content/articles.ts": "Defines article structure and provides static article content data.",
  "frontend/src/content/events.ts": "Empty placeholder file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useProfileQueries.ts": "Defines profile-related queries and mutations for listing, fetching, editing profiles, and follow summaries using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Implements post, event, admin, and like-related queries and mutations, ensuring actor availability and keeping caches updated.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Checks availability of a static asset URL using HEAD/GET with caching via React Query.",
  "frontend/src/index.css": "Tailwind-based global styles defining a light pastel theme with custom CSS variables and typography settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, values, offerings, and guidelines for the Plushie Haven community.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a single article using the slug param, showing metadata, content, or a not-found message.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles in a grid with category, read time, and links to detail pages.",
  "frontend/src/pages/ColoringPage.tsx": "Empty page placeholder with no content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements a community board with post listing, creation, editing, deletion, image uploads, and admin actions.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that opens a mailto link and an option to copy the contact email.",
  "frontend/src/pages/EventsPage.tsx": "Shows events and includes a form for authenticated users to create new events with date and time handling.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a static gallery grid of plushie-themed images with titles and descriptions.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, navigation buttons, and intro content for the plushie community.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Renders a grid of plushie brand cards with names, descriptions, and specialties, plus an about section.",
  "frontend/src/pages/ProfilePage.tsx": "Empty placeholder file for a profile page component.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Displays a directory of user profiles with avatars, names, and bios, handling loading and error states.",
  "frontend/src/utils/actorError.ts": "Converts backend errors into clear, user-friendly messages with special handling for common cases.",
  "frontend/src/utils/imageAttachment.ts": "Provides utilities for validating, converting, and formatting image files for uploads.",
  "frontend/src/utils/profileImages.ts": "Handles profile image conversions, preview URLs, and generating direct blob URLs.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks whether a static asset is reachable using HEAD and GET fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, shadows, and plugins.",
  "project_state.json": "Defines the current project state for the Plushie Haven website, including theme updates, feature changes, known issues, and architecture notes. Tracks project versioning, required UI adjustments, removed sections, and admin behavior for the Community Board."
}