{
  "backend/main.mo": "Defines a Motoko actor managing posts with create, list, and get functionality using an in‑memory map and auto‑incrementing IDs.",
  "feature_evidence.json": "Metadata file describing implemented features, associated frontend files, and confidence levels for Plushie Haven.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components, pages, hooks, and assets.",
  "frontend/index.css": "Global stylesheet defining Tailwind layers and a warm color theme with light/dark mode variables.",
  "frontend/index.html": "Base HTML entrypoint mounting the React app and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps the app with ThemeProvider and AgeGate, and renders the main layout.",
  "frontend/src/components/AgeGate.tsx": "Age‑verification component that checks localStorage and requires confirming 18+ before showing the app.",
  "frontend/src/components/AuthControls.tsx": "Internet Identity authentication UI providing sign‑in and a user dropdown with sign‑out.",
  "frontend/src/components/Layout.tsx": "Top‑level layout with header, navigation, auth controls, routed content, and footer.",
  "frontend/src/components/Nav.tsx": "Responsive navigation bar with desktop and mobile modes and active‑route highlighting.",
  "frontend/src/content/articles.ts": "Defines an Article interface and provides sample article data including slugs, metadata, and full text content.",
  "frontend/src/content/events.ts": "Defines an Event interface and exports a list of upcoming plushie-related meetups, conventions, and workshops.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, stored identity restoration, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for listing and creating posts using the authenticated backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables, including light/dark color palettes and background patterns.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders a styled About page describing the community mission, values, offerings, and guidelines.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article based on slug, showing metadata and parsed content with navigation back to the article list.",
  "frontend/src/pages/ArticlesPage.tsx": "Renders a grid of article cards using data from articles and links to individual article pages.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Displays community posts, includes a form for authenticated users to create posts, and handles validation and submission.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that opens a mailto link and includes a copy-to-clipboard email feature.",
  "frontend/src/pages/EventsPage.tsx": "Shows upcoming events in a card grid with date, location, and descriptions from events data.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery of static images with titles and descriptions in a responsive card grid.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section and feature cards linking to articles, community, and other site areas.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and container settings with plugins enabled.",
  "project_state.json": "Contains the project’s current state, required images, and a list of implemented features for the Plushie Haven website with their versions and descriptions."
}