{
  "backend/main.mo": "Main actor implementing access-controlled supporter request flow, supporter management, and user profile storage with mixins for authorization and blob storage.",
  "backend/migration.mo": "Defines old/new actor state types and a migration that adds an empty moderationQueue map to the stored state.",
  "feature_evidence.json": "Lists feature evidence entries mapping moderation-related features to their affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file summarizing the purpose of all frontend components, pages, hooks, and content modules.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes with shared global styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, age gate, and global toaster for the React application.",
  "frontend/src/components/AgeGate.tsx": "Age verification component gating site access until the user confirms they are 18+.",
  "frontend/src/components/AuthControls.tsx": "Authentication UI with sign‑in, profile display, admin claim action, and sign‑out menu.",
  "frontend/src/components/community/LinkifiedText.tsx": "Renders text with detected links and video embeds using tokenized parsing.",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Displays and processes moderation queue items with approve/reject actions and loading/error states.",
  "frontend/src/components/community/PollCard.tsx": "Shows a single poll with voting UI, results, supporter badge, and backend error handling.",
  "frontend/src/components/community/PollsSection.tsx": "Lists polls and provides a poll creation form with authentication, supporter limits, and error handling.",
  "frontend/src/components/community/PostActions.tsx": "UI component providing edit and delete dialogs for posts, handling form state and calling callbacks for updates and deletion.",
  "frontend/src/components/community/PostComments.tsx": "Handles loading, displaying, and submitting comments for a post with backend error handling and authentication checks.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Displays an attached image by converting byte data to a blob URL and cleaning it up on unmount.",
  "frontend/src/components/community/PostLikeButton.tsx": "Renders a like button that toggles likes for a post with authentication and backend availability checks.",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Embeds a video attachment using a direct streaming URL and displays it in a video element.",
  "frontend/src/components/community/VideoEmbed.tsx": "Renders a responsive iframe embed for approved video providers using a 16:9 container.",
  "frontend/src/components/Layout.tsx": "Page layout with header, navigation, auth controls, routed content, and footer.",
  "frontend/src/components/LoadingState.tsx": "Simple loading indicator with spinner and message.",
  "frontend/src/components/Nav.tsx": "Responsive navigation menu with desktop buttons and mobile sheet menu.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Empty file.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Empty file.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Empty file.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a grid of profile images using direct URLs from ExternalBlob items.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Renders a list of user profile links, normalizing URLs and opening them in new tabs.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "Displays a decorative supporter badge with a heart icon.",
  "frontend/src/content/articles.ts": "Defines the Article interface and exports an array of static article metadata and content.",
  "frontend/src/content/events.ts": "Empty file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useProfileQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, directory listings, and follow data via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for posts, moderation actions, admin checks, and related mutations using the backend actor.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Provides a query hook that checks whether a static asset URL is reachable with a HEAD/GET fallback.",
  "frontend/src/hooks/useSupporterQueries.ts": "Implements queries and mutations for supporter profiles, supporter requests, and admin approval flows.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining a light-themed color palette and base styles.",
  "frontend/src/main.tsx": "Application entry point that initializes React, wraps the app in React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details, community values, offerings, and guidelines using card-based layout.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Displays a grid of adult pacifier brands with descriptions and specialties, plus a section explaining the list.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Shows a full article based on URL slug with metadata, content rendering, and a back-to-articles link.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles in a responsive card grid with category, read time, and links to detail pages.",
  "frontend/src/pages/ColoringPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements the community board with post listing, creation, editing, media uploads, moderation, and supporter features.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form and copy-to-clipboard email option for user inquiries.",
  "frontend/src/pages/EventsPage.tsx": "Displays events, handles creation of new events, and manages backend-unavailable states with alerts.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a grid of preset plushie gallery images using cards with titles and descriptions.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, calls to action, and a fallback image handler.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Shows a list of plushie brands in cards with names, descriptions, and specialty badges.",
  "frontend/src/pages/ProfilePage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Shows a card indicating that the profiles directory is currently unavailable.",
  "frontend/src/pages/SupportPage.tsx": "Implements supporter request submission, admin approval tools, and error handling with multiple hooks.",
  "frontend/src/utils/actorError.ts": "Normalizes various backend errors into readable messages and sanitizes internal error details.",
  "frontend/src/utils/imageAttachment.ts": "Provides utilities for validating image files and converting them to typed byte data.",
  "frontend/src/utils/linkifyText.ts": "Parses text into tokens by detecting URLs, normalizing them, and identifying YouTube/Vimeo embeds.",
  "frontend/src/utils/profileImages.ts": "Converts File objects to bytes or ExternalBlob, and manages preview URLs for profile images.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks reachability of static assets using HEAD with GET fallback and abort control.",
  "frontend/src/utils/urlParams.ts": "Retrieves, stores, and clears URL or session parameters, supporting both query and hash routing.",
  "frontend/src/utils/videoAttachment.ts": "Validates video files against type and size limits and formats file sizes.",
  "frontend/src/utils/videoEmbeds.ts": "Detects YouTube and Vimeo URLs and returns structured embed descriptors.",
  "frontend/tailwind.config.js": "Configures Tailwind with plugins, custom colors, typography, layout, and animation settings.",
  "project_state.json": "Defines project state, requirements, features, and pending moderation-related feature requests."
}