{
  "backend/main.mo": "Main backend actor handling supporter requests, supporter management, and user profile storage with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module defining old/new actor data structures and a run function to convert stored state between versions.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file across components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode values, and base styling rules.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, wraps the app with ThemeProvider and AgeGate, and initializes the router.",
  "frontend/src/components/AgeGate.tsx": "Age-verification component requiring users to confirm they are 18+ before accessing the site.",
  "frontend/src/components/AuthControls.tsx": "Provides authentication UI, profile navigation, and admin-claim actions based on Internet Identity state.",
  "frontend/src/components/community/LinkifiedText.tsx": "Parses text into tokens and renders links and video embeds safely without innerHTML.",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Shows moderation queue items with approve/reject actions and handles loading and error states.",
  "frontend/src/components/community/PollCard.tsx": "Displays a poll with voting UI, results, supporter badge, and backend error handling.",
  "frontend/src/components/community/PollsSection.tsx": "Lists polls and provides a form for creating new polls with option limits and error handling.",
  "frontend/src/components/community/PostActions.tsx": "Provides edit and delete buttons for posts with dialogs for updating fields or confirming removal.",
  "frontend/src/components/community/PostComments.tsx": "Handles loading, displaying, and submitting comments with authentication checks and backend error handling.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Creates a blob URL from image bytes and renders an attached post image.",
  "frontend/src/components/community/PostLikeButton.tsx": "Displays like count and toggles like/unlike actions with backend availability checks.",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Streams and displays an attached video using a direct URL from an ExternalBlob.",
  "frontend/src/components/community/VideoEmbed.tsx": "Renders a responsive 16:9 iframe embed for approved video providers.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Shows a fullscreen lightbox for gallery media with navigation, favorite toggling, and optional deletion confirmation.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Allows uploading image or video files with validation, progress tracking, and metadata input.",
  "frontend/src/components/Layout.tsx": "Defines the site’s main layout with header, navigation, footer, and outlet for routed pages.",
  "frontend/src/components/LoadingState.tsx": "Displays a centered loading spinner with an optional message.",
  "frontend/src/components/Nav.tsx": "Renders responsive navigation links with active-state highlighting for desktop and mobile.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Image uploader component for profile avatars with validation, preview handling, and blob conversion.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Full profile edit form handling display name, bio, avatar, links, plushie images, and saving to backend.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Manages uploading, previewing, and removing multiple plushie images with validation and blob conversion.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a grid of profile-related images using their direct URLs.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Renders a list of external profile links with sanitized URLs.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "Shows a styled supporter badge with a heart icon.",
  "frontend/src/content/articles.ts": "Defines article structure and provides sample plushie-related articles.",
  "frontend/src/content/events.ts": "Empty content module for events.",
  "frontend/src/content/teddyStorybook.ts": "Exports a short storybook entry about Teddy's forest adventure.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances tied to Internet Identity with query invalidation.",
  "frontend/src/hooks/useGalleryFavorites.ts": "Hook for managing gallery favorites using localStorage with toggle and lookup functions.",
  "frontend/src/hooks/useGalleryMediaQueries.ts": "React-query hooks for listing, adding, and deleting gallery media items using an actor backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider handling auth client creation, login flow, stored identity loading, and status tracking.",
  "frontend/src/hooks/useProfileQueries.ts": "Hooks for fetching and updating user profiles, including directory listings, profile pages, and caller profile editing.",
  "frontend/src/hooks/useQueries.ts": "General data hooks for posts, moderation, and admin checks with create, edit, delete, and list operations via the actor.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Hook to check availability of a static asset using a HEAD/GET strategy and caching.",
  "frontend/src/hooks/useSupporterQueries.ts": "Hooks for querying, submitting, and approving supporter-related data and requests using the actor backend.",
  "frontend/src/index.css": "Tailwind-based theme definitions with a light plush aesthetic and global styles for typography and layout.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the site's mission, values, offerings, and guidelines using cards and icons.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Displays a grid of adult pacifier brands with descriptions and specialties, plus an info section about the list.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Shows a full article based on URL slug with category, read time, summary, and formatted content.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles in card format with category, read time, title, and summary, linking to article detail pages.",
  "frontend/src/pages/ColoringPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements a community board with post creation, media uploads, moderation, likes, comments, and backend error handling.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that sends email via mailto and lets users copy the contact address.",
  "frontend/src/pages/EventsPage.tsx": "Allows users to view and create events with validation, backend error handling, and date formatting.",
  "frontend/src/pages/GalleryPage.tsx": "Interactive gallery page with search, favorites, lightbox navigation, and authenticated deletion of uploaded media.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero image, brand intro, and links to articles and community sections.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Displays a grid of curated plushie brands with descriptions and specialties.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page supporting viewing, editing, following, liking, and handling empty-state or error scenarios.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Lists public profiles with loading and error states and allows authenticated users to create their own profile.",
  "frontend/src/pages/SupportPage.tsx": "React page allowing users to submit supporter requests and admins to approve or revoke them while displaying supporter data.",
  "frontend/src/utils/actorError.ts": "Utilities to detect, sanitize, and convert backend errors into user-friendly messages.",
  "frontend/src/utils/galleryMedia.ts": "Defines gallery item types and utilities to merge static, storybook, and uploaded media into a unified list.",
  "frontend/src/utils/imageAttachment.ts": "Helpers for validating, reading, and formatting image files for uploads.",
  "frontend/src/utils/linkifyText.ts": "Parses text into tokens for URLs and video embeds with safe normalization.",
  "frontend/src/utils/profileImages.ts": "Utilities for converting files to ExternalBlob, preview URLs, and retrieving blob URLs for profile images.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks reachability of static assets using HEAD with GET fallback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/src/utils/videoAttachment.ts": "Provides accepted video MIME types, a 100MB size limit, a file-size formatter, and a validator for uploaded video files.",
  "frontend/src/utils/videoEmbeds.ts": "Parses URLs to detect YouTube or Vimeo videos and returns a normalized embed descriptor or null.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, shadows, container settings, and plugin integrations.",
  "project_state.json": "Stores the project's current state, feature list, and pending requests for gallery media deletion features."
}