{
  "backend/main.mo": "IC canister with user profile CRUD, access control, blob storage mixins, and legacy post/event models and creation logic.",
  "feature_evidence.json": "Feature evidence report listing coloring‑page removal tasks, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collected summaries describing the purpose of each frontend file, including pages, components, hooks, and content files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes using OKLCH color tokens.",
  "frontend/index.html": "Root HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routing, theme provider, age gate, and route tree for all site pages.",
  "frontend/src/components/AgeGate.tsx": "Age‑verification wrapper requiring 18+ confirmation via localStorage before rendering child content.",
  "frontend/src/components/AuthControls.tsx": "Header auth UI handling II login, admin claim action, profile display name, and sign‑out dropdown.",
  "frontend/src/components/community/PostActions.tsx": "Provides edit and delete buttons with dialogs for modifying or removing a post.",
  "frontend/src/components/community/PostComments.tsx": "Handles comment display, toggling, and submission for a post with authentication checks.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Displays an image attachment by converting raw bytes into a blob URL.",
  "frontend/src/components/community/PostLikeButton.tsx": "Shows like count and toggles liking/unliking a post with authentication.",
  "frontend/src/components/Layout.tsx": "Defines the main site layout with header navigation, outlet content, and footer.",
  "frontend/src/components/LoadingState.tsx": "Displays a centered loading spinner with an optional message.",
  "frontend/src/components/Nav.tsx": "Renders desktop and mobile navigation menus with active link highlighting.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Empty placeholder file.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Empty placeholder file.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Empty placeholder file.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Renders a grid of profile images using direct blob URLs.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Lists external profile links, ensuring URLs are safely formatted.",
  "frontend/src/content/articles.ts": "Defines article interface and provides static article data.",
  "frontend/src/content/events.ts": "Empty placeholder content file.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and loading stored identities.",
  "frontend/src/hooks/useProfileQueries.ts": "Contains React Query hooks for fetching and mutating user profiles, directory listings, and follow data via the actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for posts, events, likes, and admin checks using the actor API.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Checks availability of a static asset URL using a cached query with robust fallback logic.",
  "frontend/src/index.css": "Defines Tailwind base styles and a pastel-themed color palette for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, values, offerings, and community guidelines.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article based on slug, with category, read time, summary, and rendered body; shows a not-found message if missing.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles in card form with category, read time, title, and summary, linking to individual detail pages.",
  "frontend/src/pages/ColoringPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements a community board with post listing, creation, editing, deletion, and optional image attachments, including validation and preview handling.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that opens a mailto link and an option to copy the contact email to clipboard.",
  "frontend/src/pages/EventsPage.tsx": "Displays events and includes a form for authenticated users to create new events with validation and timestamp formatting.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a static gallery of plushie images with titles and descriptions in a grid layout.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring a hero section with branding, navigation buttons, and fallback hero image handling.",
  "frontend/src/pages/ProfilePage.tsx": "Component that loads a user profile and follow/like summaries, and provides UI actions for following and liking with error handling.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Lists public profiles with avatars and bios, handling loading and error states, and renders a grid of profile cards.",
  "frontend/src/utils/actorError.ts": "Normalizes backend error objects into readable messages for common authorization and validation cases.",
  "frontend/src/utils/imageAttachment.ts": "Utilities for validating, converting, and formatting image files used as attachments, including size/type checks.",
  "frontend/src/utils/profileImages.ts": "Helpers for converting files to ExternalBlob format, generating preview URLs, and accessing direct blob URLs.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks availability of a static asset using HEAD or fallback GET requests with abort handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, shadows, and enabled plugins.",
  "project_state.json": "Stores the project’s current versioned state, including visual/theme directives, feature requirements, moderation rules, profile behavior, and known UI issues for the Plushie Haven site."
}