{
  "backend/main.mo": "Main Motoko actor implementing supporter request/approval system, user profiles with avatar/links/plushie images, access control integration, and blob storage mixin for managing user-generated content.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of a navigation link to https://reflect-and-create.lovable.app/ in Nav.tsx with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, content, and styles; documents routing, authentication, gallery, community board, events, profiles, and admin features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Plushie Haven React application with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, articles, events, brands, profiles, assistant, admin), role guards for admin routes, theme provider, age gate, session timeout warning, and toast notifications.",
  "frontend/src/components/AgeGate.tsx": "Age verification component that displays an 18+ confirmation dialog on first visit, stores confirmation in localStorage, and blocks access if declined.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-page access denied screen showing error message based on authentication status and role requirements, with navigation options to sign in or return home.",
  "frontend/src/components/auth/RoleGuard.tsx": "Role-based authorization guard component that checks user permissions against required role hierarchy and displays AccessDeniedScreen or custom fallback if unauthorized.",
  "frontend/src/components/AuthControls.tsx": "Authentication dropdown menu component displaying user identity/profile, role badge, admin claim functionality, profile navigation (view/edit), and logout with cache clearing.",
  "frontend/src/components/community/LinkifiedText.tsx": "Empty file with no content.",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Empty file with no content.",
  "frontend/src/components/community/PollCard.tsx": "Empty file with no content.",
  "frontend/src/components/community/PollsSection.tsx": "Empty file with no content.",
  "frontend/src/components/community/PostActions.tsx": "Empty file with no content.",
  "frontend/src/components/community/PostComments.tsx": "Empty file with no content.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Empty file with no content.",
  "frontend/src/components/community/PostLikeButton.tsx": "Empty file with no content.",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Empty file with no content.",
  "frontend/src/components/community/VideoEmbed.tsx": "Empty file with no content.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Empty file with no content.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Empty file with no content.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo, navigation, and auth controls, plus a footer with copyright and links. Uses React Router's Outlet for nested routes.",
  "frontend/src/components/LoadingState.tsx": "Reusable loading indicator component displaying an animated spinner with customizable message and styling.",
  "frontend/src/components/Nav.tsx": "Navigation component with responsive desktop/mobile menus, main nav links, external link to Reflect & Create, and admin dropdown menu for privileged users. Uses Sheet component for mobile drawer.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Avatar upload component with file validation (type, size), preview functionality, and conversion to ExternalBlob format. Includes remove functionality and displays upload constraints.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Profile editing form component managing display name, bio, avatar, links, plushie images, and directory visibility. Handles both profile creation and updates with validation and toast notifications.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "React component for editing plushie images with upload, preview, and removal functionality. Manages image validation, file-to-blob conversion, and preview URL lifecycle with drag-and-drop support.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Simple display component that renders a grid of plushie images from ExternalBlob objects. Shows images in a responsive 2-3 column layout with hover effects.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Component that displays a list of external links with icons. Ensures URLs have proper http/https protocol and opens links in new tabs.",
  "frontend/src/components/SessionTimeoutWarning.tsx": "Alert dialog that warns users before session timeout with countdown timer and option to extend session.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "Displays a gradient badge with a heart icon to indicate supporter status. Uses a pink-to-primary gradient styling.",
  "frontend/src/content/articles.ts": "Defines article data structure and exports an array of educational articles about plushie care, display ideas, and collecting guides with metadata like read time and category.",
  "frontend/src/content/events.ts": "Empty file, likely a placeholder for future event content definitions.",
  "frontend/src/content/teddyStorybook.ts": "Exports a storybook content object containing a children's story about Teddy the bear's forest adventure, including title, description, cover image, and full story text.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity login state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAssistantChat.ts": "Hook for managing chat state with the plushie assistant, including message history, session state, localStorage persistence, and quick action buttons for common queries.",
  "frontend/src/hooks/useEventQueries.ts": "Defines event type and provides React Query hooks for listing and creating events, currently returning empty data as backend implementation is pending.",
  "frontend/src/hooks/useGalleryFavorites.ts": "Empty file, likely a placeholder for gallery favorites functionality.",
  "frontend/src/hooks/useGalleryMediaQueries.ts": "Empty file, likely a placeholder for gallery media query hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive React hook and provider for Internet Identity authentication, managing login/logout flow, identity persistence, delegation validation, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useProfileQueries.ts": "React Query hooks for user profile operations including listing directory profiles, fetching user profiles, following/unfollowing users, and managing follow counts.",
  "frontend/src/hooks/useQueries.ts": "Empty file with no content.",
  "frontend/src/hooks/useSessionTimeout.ts": "Hook that manages automatic session timeout with configurable inactivity period (default 30 minutes), shows warnings before logout, and tracks user activity across multiple event types.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "React Query hook that checks if a static asset is available at a given URL using a HEAD request with GET fallback strategy, with 5-minute cache.",
  "frontend/src/hooks/useSupporterQueries.ts": "React Query hooks for supporter management including fetching supporters, checking supporter status, submitting supporter requests, and admin operations for approving/rejecting supporters.",
  "frontend/src/hooks/useUserRole.ts": "Hooks for fetching and checking user roles (guest, user, admin) with permission hierarchy validation and convenience hooks for admin/moderator checks.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette featuring baby blue and pastel pink theme for a cozy plushie aesthetic, maintaining light theme even in dark mode.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider context, then renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static page displaying Plushie Haven's mission, community values, offerings, and guidelines for adult plushie enthusiasts in a card-based layout.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page for user management with search interface and role assignment UI, currently showing placeholder content with alert indicating backend implementation is required.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Displays a grid of adult pacifier brands with descriptions, specialties, and badges. Includes an informational section about the curated brand list.",
  "frontend/src/pages/AnalyticsDashboardPage.tsx": "Shows analytics dashboard with metrics for events, supporters, and pending requests. Displays metric cards and a community overview section using data from custom hooks.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Renders individual article detail pages with title, category badge, read time, and formatted content. Includes back navigation and 404 handling for missing articles.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays a grid of article cards with category badges, read times, and summaries. Each card links to the detailed article page.",
  "frontend/src/pages/AuditLogPage.tsx": "Placeholder page for audit logs with search functionality. Shows an alert indicating backend implementation is required for this feature.",
  "frontend/src/pages/ColoringPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Empty file with no content.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with email composition functionality and copy-to-clipboard feature. Allows users to send messages via mailto link or copy the contact email address.",
  "frontend/src/pages/EventsPage.tsx": "Events management page with create event form and event listing. Handles authentication, date/time validation, backend error states, and displays events with formatted timestamps.",
  "frontend/src/pages/GalleryPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Landing page for Plushie Haven featuring a hero section with logo and tagline, navigation to articles, and a \"Plushie Moments\" section showcasing community content with image fallback handling.",
  "frontend/src/pages/ModerationDashboardPage.tsx": "Empty file, likely a placeholder for future moderation dashboard functionality.",
  "frontend/src/pages/PlushieAssistantPage.tsx": "Chat interface for the Plushie Pal Assistant with message history, quick action buttons, auto-scrolling, and clear chat functionality using the useAssistantChat hook.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Static informational page displaying a grid of 13 popular plushie brands with descriptions and specialty badges (Collectible, Premium, Heritage, etc.).",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying profile details, follow counts, follow/unfollow actions, and an edit panel for own profiles; handles both authenticated user's own profile and viewing other users' profiles.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Directory listing page showing all public community profiles in a grid layout with navigation to individual profiles and prompts for unauthenticated users to sign in or create profiles.",
  "frontend/src/pages/SupportPage.tsx": "React page component for supporter management, allowing users to submit supporter requests and admins to approve/revoke supporters. Displays external support links (Ko-fi, Patreon) and manages supporter status with forms and lists.",
  "frontend/src/pages/SystemSettingsPage.tsx": "Placeholder admin page for system-wide settings with tabs for features, content limits, moderation, and session configuration. Currently displays alerts indicating backend implementation is required.",
  "frontend/src/utils/actorError.ts": "Utility functions to normalize backend actor errors into user-friendly messages, handling stopped canisters, authorization errors, moderation blocks, and admin claim errors. Includes error message sanitization to remove internal IDs and diagnostics.",
  "frontend/src/utils/galleryMedia.ts": "Empty utility file for gallery media handling (no content).",
  "frontend/src/utils/imageAttachment.ts": "Image validation utilities defining accepted types (PNG, JPEG, WebP), max size (2MB), and functions to validate image files and format file sizes.",
  "frontend/src/utils/inputValidation.ts": "Comprehensive input validation utilities for text length, usernames, URLs, file uploads, and dangerous HTML/script content detection.",
  "frontend/src/utils/linkifyText.ts": "Empty utility file for text linkification (no content).",
  "frontend/src/utils/plushieAssistant.ts": "AI assistant logic for plushie recommendations and stories, managing conversation state, intent detection, and generating contextual responses for care tips, fun facts, and guided recommendation flows.",
  "frontend/src/utils/profileImages.ts": "Utility functions for converting Files to Uint8Array and ExternalBlob format, creating and revoking preview URLs, and getting direct URLs from ExternalBlob for profile image handling.",
  "frontend/src/utils/sanitization.ts": "Provides sanitization utilities for user input including HTML stripping/escaping, URL protocol validation, whitespace normalization, and text sanitization with optional length limits.",
  "frontend/src/utils/staticAssetCheck.ts": "Exports a function to check static asset availability by attempting HEAD request first, then falling back to aborted GET request if HEAD is unsupported or fails.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/src/utils/videoAttachment.ts": "Empty file with no content.",
  "frontend/src/utils/videoEmbeds.ts": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom font families (Quicksand, Nunito), sidebar colors, custom shadows, and animation keyframes.",
  "project_state.json": "Project state file for \"Plushie Haven\" (Caffeine app) tracking feature requests to add navigation link to external Lovable app URL in a new tab."
}