{
  "backend/main.mo": "Main canister actor handling supporter requests, supporter management, and user profile storage with access control and blob storage mixins.",
  "backend/migration.mo": "Defines data migration from old post/moderation structures to new versions by adding image fields and mapping existing data.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing component responsibilities and behaviors.",
  "frontend/index.css": "Tailwind CSS setup defining base styles and extensive light/dark theme CSS variables.",
  "frontend/index.html": "Basic HTML entry point mounting the frontend app and loading the main script.",
  "frontend/src/App.tsx": "Sets up app-wide routing, theming, layout, and global providers including the AgeGate and toaster.",
  "frontend/src/components/AgeGate.tsx": "Age-verification wrapper that enforces an 18+ confirmation before rendering the app content.",
  "frontend/src/components/AuthControls.tsx": "Renders authentication controls with login, profile navigation, and admin-claim handling using Internet Identity and actor queries.",
  "frontend/src/components/community/LinkifiedText.tsx": "Parses text into tokens and renders links, videos, and plain text safely without innerHTML.",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Shows the moderation queue with approve and reject actions, loading states, and error handling.",
  "frontend/src/components/community/PollCard.tsx": "Displays an individual poll with voting UI, results, supporter badge, and backend-unavailable handling.",
  "frontend/src/components/community/PollsSection.tsx": "Lists polls and provides a form for creating new polls with validation, supporter limits, and error states.",
  "frontend/src/components/community/PostActions.tsx": "Provides edit and delete UI for posts, including dialogs and form handling for updating and removing posts.",
  "frontend/src/components/community/PostComments.tsx": "Displays and submits comments for a post, with backend error handling, authentication checks, and expandable comment section.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Renders an attached image for a post using an ExternalBlob's direct URL.",
  "frontend/src/components/community/PostLikeButton.tsx": "Shows like count and handles liking/unliking posts with backend availability checks.",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Displays a video attachment using a direct URL and supports multiple video formats in a video player.",
  "frontend/src/components/community/VideoEmbed.tsx": "Embeds responsive 16:9 iframes for allowed video providers like YouTube or Vimeo.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Full‑screen lightbox for gallery items with navigation, favorites, deletion, and keyboard controls.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Dialog for uploading gallery media with file validation, progress tracking, and backend submission.",
  "frontend/src/components/Layout.tsx": "Defines the app's main layout including header with navigation, footer, and routed content outlet.",
  "frontend/src/components/LoadingState.tsx": "Displays a centered loading spinner with an optional message.",
  "frontend/src/components/Nav.tsx": "Provides responsive navigation with desktop buttons and a mobile sheet menu.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Handles avatar selection, validation, previewing, conversion to ExternalBlob, and removal for profile editing.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Provides a full editable profile form with avatar, bio, links, plushie images, and save logic using profile queries.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Manages uploading, validating, previewing, and removing multiple plushie image blobs in a profile.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a responsive grid of plushie image previews from ExternalBlob URLs.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Renders a list of external profile links with safe URL formatting and icons.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "Shows a styled supporter badge with a heart icon.",
  "frontend/src/content/articles.ts": "Defines the Article interface and provides a list of static article entries with metadata and content.",
  "frontend/src/content/events.ts": "Empty module reserved for event-related content.",
  "frontend/src/content/teddyStorybook.ts": "Exports metadata and full text for the Teddy's Little Forest Adventure storybook entry.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to user identity, with query caching and invalidation behavior.",
  "frontend/src/hooks/useAssistantChat.ts": "Implements chat state, message processing, session persistence, and quick actions for the assistant UI.",
  "frontend/src/hooks/useGalleryFavorites.ts": "Manages a Set of favorite gallery item IDs with localStorage sync and toggle helpers.",
  "frontend/src/hooks/useGalleryMediaQueries.ts": "Provides React Query hooks for listing, uploading, and deleting gallery media items via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for auth loading, login, and state management.",
  "frontend/src/hooks/useProfileQueries.ts": "Supplies profile-related React Query hooks for fetching, editing, and listing user profiles.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for posts, polls, comments, and related CRUD operations using the backend actor.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Checks availability of static assets via a cached HEAD/GET strategy.",
  "frontend/src/hooks/useSupporterQueries.ts": "Defines supporter-related queries and mutations including supporter lists, requests, and approvals.",
  "frontend/src/index.css": "Tailwind-based global styles defining a light pastel theme with custom CSS variables.",
  "frontend/src/main.tsx": "Application entry point wiring React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission, values, offerings, and community guidelines using card-based layout.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Displays a grid of adult pacifier brands with descriptions and specialties plus an informational section.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Shows a full article based on slug, including metadata, content, and navigation back to the articles list.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles with category, read time, and summaries, linking to individual article detail pages.",
  "frontend/src/pages/ColoringPage.tsx": "Empty placeholder file for a coloring page component.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements a community board with post creation, media attachments, moderation, likes, comments, and backend error handling.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form and copy-to-clipboard email option for reaching site administrators.",
  "frontend/src/pages/EventsPage.tsx": "Allows users to view and create events with validation, backend integration, and error handling.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page that loads, filters, previews, favorites, and deletes gallery media with lightbox support and connection warnings.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, promotional text, CTAs, and featured plushie imagery.",
  "frontend/src/pages/PlushieAssistantPage.tsx": "Chat interface for the plushie assistant with message history, quick actions, and send/clear controls.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Static page listing major plushie brands with descriptions and specialties.",
  "frontend/src/pages/ProfilePage.tsx": "Profile viewer supporting follow/like actions, editing, and handling missing or own-profile states.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Renders a directory of public profiles with loading, error, empty states, and navigation to create or view profiles.",
  "frontend/src/pages/SupportPage.tsx": "Implements supporter request submission, admin approval tools, and displays supporter data with authentication checks.",
  "frontend/src/utils/actorError.ts": "Normalizes backend errors into user-friendly messages and sanitizes low-level error details.",
  "frontend/src/utils/galleryMedia.ts": "Defines gallery item types and helpers to merge static, storybook, and uploaded media into a unified list.",
  "frontend/src/utils/imageAttachment.ts": "Provides functions to validate image file size/type and convert File objects to usable byte data.",
  "frontend/src/utils/linkifyText.ts": "Parses text into tokens detecting URLs and video embeds for safe rendering.",
  "frontend/src/utils/plushieAssistant.ts": "Implements intent detection and response logic for a plushie assistant, including recommendation flow, care tips, and fun facts.",
  "frontend/src/utils/profileImages.ts": "Provides helpers to convert image files into bytes or ExternalBlob objects and manage preview URLs.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks whether a static asset URL is reachable using HEAD with a GET fallback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/src/utils/videoAttachment.ts": "Defines accepted video types, size limits, and validation helpers for video file uploads.",
  "frontend/src/utils/videoEmbeds.ts": "Parses YouTube and Vimeo URLs to extract video IDs and produce embed descriptors via an allowlist.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, shadows, and plugins for the frontend.",
  "project_state.json": "Describes the project's current state and requirements, focused on adding and fixing image attachment support for community board posts."
}