{
  "backend/main.mo": "Motoko canister handling access-controlled supporter requests, supporter approvals, and user profile storage and editing.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, tests, and confidence ratings.",
  "frontend-file-summaries.txt": "Collection of one-line summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS base setup defining light and dark theme CSS variables and global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, global layout, theme provider, age gate, and app-level components.",
  "frontend/src/components/AgeGate.tsx": "Age verification wrapper requiring 18+ confirmation before showing the app.",
  "frontend/src/components/AuthControls.tsx": "Authentication dropdown with login, admin claim, and navigation to the user's profile or profile editor.",
  "frontend/src/components/community/LinkifiedText.tsx": "Parses text into tokens to render links, plain text, and embedded videos safely.",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Displays and manages the moderation queue with approve/reject actions and loading/error states.",
  "frontend/src/components/community/PollCard.tsx": "Shows a poll with results, voting UI, supporter badge, and backend error handling.",
  "frontend/src/components/community/PollsSection.tsx": "Lists polls, handles poll creation, and displays backend availability errors.",
  "frontend/src/components/community/PostActions.tsx": "Provides edit and delete dialogs for posts with form handling and action buttons.",
  "frontend/src/components/community/PostComments.tsx": "Displays and submits post comments with authentication checks, backend error handling, and expandable UI.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Renders an attached post image by converting byte data to a blob URL.",
  "frontend/src/components/community/PostLikeButton.tsx": "Handles liking and unliking posts with authentication, backend availability checks, and like count display.",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Shows a video attachment using a direct blob URL for playback.",
  "frontend/src/components/community/VideoEmbed.tsx": "Embeds responsive allowlisted video iframes such as YouTube or Vimeo.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Full-screen lightbox for viewing gallery items with navigation, keyboard support, and favorite toggling.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Dialog for uploading image or video media with validation, progress tracking, and backend submission.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout with header, navigation, outlet content, and footer.",
  "frontend/src/components/LoadingState.tsx": "Shows a centered loading spinner and message for async states.",
  "frontend/src/components/Nav.tsx": "Renders responsive navigation with desktop buttons and a mobile sheet menu.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Handles avatar upload with validation, preview generation, removal, and conversion to ExternalBlob.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Profile editor with form state, image and link management, and save mutation handling.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Manages upload, preview, and removal of multiple plushie image blobs.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a grid of plushie image blobs using their direct URLs.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Renders a list of external profile links with safe URL handling.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "Simple UI badge component for marking supporter status.",
  "frontend/src/content/articles.ts": "Static list of article metadata and full content for the site.",
  "frontend/src/content/events.ts": "Empty placeholder for events content.",
  "frontend/src/content/teddyStorybook.ts": "Static storybook entry describing Teddy’s forest adventure.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity; refreshes dependent queries on change.",
  "frontend/src/hooks/useGalleryFavorites.ts": "LocalStorage-backed hook for toggling and persisting gallery favorites.",
  "frontend/src/hooks/useGalleryMediaQueries.ts": "React Query hooks for listing and uploading gallery media items via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading stored identities, login flow, and status flags.",
  "frontend/src/hooks/useProfileQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, including directory listings, profile pages, caller profile, and profile updates.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for posts, moderation requests, admin checks, and related mutations, ensuring actor availability before operations.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Exposes a hook to check availability of static assets using a robust fetch strategy with caching.",
  "frontend/src/hooks/useSupporterQueries.ts": "Provides hooks for supporter-related queries and mutations, including supporter lists, requests, and admin approval flows.",
  "frontend/src/index.css": "Configures Tailwind CSS with a custom pastel color palette and global styles for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission details, community values, offerings, and guidelines using cards and icon sections.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Displays a grid of adult pacifier brands with descriptions and specialties plus an informational section about the list.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Shows a full article based on slug routing, including metadata, content rendering, and a back-navigation button.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles with category, read time, and summaries, linking each card to its detail page.",
  "frontend/src/pages/ColoringPage.tsx": "Empty placeholder file with no content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements a community board with post creation, media uploads, moderation tools, and listing posts with interactions.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that opens an email client and includes a copy-to-clipboard email field.",
  "frontend/src/pages/EventsPage.tsx": "Handles event listing and creation with validation, backend availability checks, and formatted event display.",
  "frontend/src/pages/GalleryPage.tsx": "Implements a gallery with search, favorites, uploads, authentication prompts, and a lightbox viewer with navigation.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, community intro, images, and navigation buttons to articles and community pages.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Displays a grid of predefined plushie brands with descriptions and specialties, plus an informational section.",
  "frontend/src/pages/ProfilePage.tsx": "Handles viewing, editing, liking, and following user profiles with authentication-aware logic and various profile states.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Lists public profiles with loading/error states and supports creating a new profile or navigating to existing ones.",
  "frontend/src/pages/SupportPage.tsx": "React page for submitting, viewing, approving, and revoking supporter requests, with admin controls and form handling.",
  "frontend/src/utils/actorError.ts": "Normalizes backend errors into user-friendly messages, including authorization, moderation, and canister-related issues.",
  "frontend/src/utils/galleryMedia.ts": "Defines gallery item types, static and storybook items, and utilities to merge, convert, and filter mixed gallery media.",
  "frontend/src/utils/imageAttachment.ts": "Provides image upload utilities including file conversion, validation, and formatting for size and accepted types.",
  "frontend/src/utils/linkifyText.ts": "Parses text into tokens detecting URLs and video embeds, returning structured link and video metadata.",
  "frontend/src/utils/profileImages.ts": "Handles file-to-byte conversion, ExternalBlob creation, and preview URL management for profile images.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks availability of static assets using HEAD or fallback GET requests with abort logic.",
  "frontend/src/utils/urlParams.ts": "Manages URL and session-based parameters with helpers for extracting, persisting, and clearing values.",
  "frontend/src/utils/videoAttachment.ts": "Provides accepted video types, max file size, formatting helper, and a validator for uploaded video files.",
  "frontend/src/utils/videoEmbeds.ts": "Parses URLs to detect YouTube or Vimeo links and returns structured embed metadata, or null if unsupported.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Defines the current project state and requirements for fixing the profile creation flow and redirect behavior."
}