{
  "backend/main.mo": "Motoko canister managing access control, supporter requests and approvals, and user profile storage with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented frontend files to two gallery‑related feature IDs with component versions and confidence levels.",
  "frontend-file-summaries.txt": "Text file listing short summaries for numerous frontend files, describing their roles in routing, UI, content pages, and hooks.",
  "frontend/index.css": "Tailwind base layer defining light and dark theme CSS variables and applying global background, text, and border styles.",
  "frontend/index.html": "Base HTML document that mounts the React app and loads main.tsx as the entry script.",
  "frontend/src/App.tsx": "Root React application configuring TanStack Router routes and wrapping the app with ThemeProvider, AgeGate, and Toaster.",
  "frontend/src/components/AgeGate.tsx": "Component enforcing an 18+ confirmation dialog using localStorage before rendering children.",
  "frontend/src/components/AuthControls.tsx": "Authentication dropdown handling login, admin-claim attempts, and navigation to the user's profile or edit page.",
  "frontend/src/components/community/LinkifiedText.tsx": "Converts text into tokens and renders links, video embeds, and plain text safely.",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Fetches and displays moderation queue items with approve/reject actions and loading/error handling.",
  "frontend/src/components/community/PollCard.tsx": "Shows an individual poll with voting UI, results, supporter badge, and backend error handling.",
  "frontend/src/components/community/PollsSection.tsx": "Lists existing polls and provides a form for authenticated users to create new polls with option limits.",
  "frontend/src/components/community/PostActions.tsx": "Offers edit and delete actions for posts using dialogs, with form state and async handlers.",
  "frontend/src/components/community/PostComments.tsx": "Displays comments for a post, handles loading, backend errors, and authenticated comment submission.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Renders an image attachment by converting byte data to a Blob URL and cleaning it up on unmount.",
  "frontend/src/components/community/PostLikeButton.tsx": "Shows like count and toggles like/unlike actions with backend‑error handling and auth checks.",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Embeds a video attachment using a direct streaming URL from an ExternalBlob.",
  "frontend/src/components/community/VideoEmbed.tsx": "Renders a responsive 16:9 iframe embed for approved video providers like YouTube or Vimeo.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Full‑screen lightbox for gallery items with keyboard navigation, media display, and favorite toggling.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Dialog for uploading image or video files with validation, progress tracking, and backend submission.",
  "frontend/src/components/Layout.tsx": "Provides the main site layout with header, navigation, outlet content, and footer.",
  "frontend/src/components/LoadingState.tsx": "Displays a centered loading spinner with an optional message.",
  "frontend/src/components/Nav.tsx": "Renders desktop and mobile navigation menus with active link highlighting.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Handles avatar image selection, validation, previewing, conversion to ExternalBlob, and removal.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Profile editor panel allowing users to update display name, bio, avatar, links, plushie images, and visibility, with save and validation logic.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Manages adding, previewing, validating, and removing multiple plushie images and updates parent with new blobs.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a responsive grid of plushie images using their direct URLs.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Renders a list of external profile links, normalizing URLs and opening them in new tabs.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "Simple supporter badge component with a heart icon and gradient styling.",
  "frontend/src/content/articles.ts": "Defines the Article type and exports a list of article objects with metadata and full content.",
  "frontend/src/content/events.ts": "Empty file reserved for event content definitions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useGalleryFavorites.ts": "Provides localStorage-backed favorite gallery item tracking with toggle and lookup methods.",
  "frontend/src/hooks/useGalleryMediaQueries.ts": "React Query hooks for listing and uploading gallery media items through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, managing login, stored identity loading, and related state.",
  "frontend/src/hooks/useProfileQueries.ts": "Provides React Query hooks for fetching, editing, and saving user profiles and follow data using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for posts, moderation, and admin checks, including creation, editing, deletion, and list fetching.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Exports a hook that checks whether a static asset URL is reachable with caching and retry logic.",
  "frontend/src/hooks/useSupporterQueries.ts": "Implements supporter-related queries and mutations, including fetching supporters, submitting requests, and admin approval actions.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and a soft pastel color theme for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page describing the community mission, values, offerings, and guidelines.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Renders a grid of adult pacifier brand cards with names, specialties, and descriptions, plus an informational section about the list.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article based on URL slug with category, read time, summary, and parsed content; shows a not-found message if missing.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles as clickable cards showing category, read time, title, and summary.",
  "frontend/src/pages/ColoringPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements a community board with post creation, editing, deletion, media attachments, moderation tools, and backend availability checks.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that opens a prefilled email and an option to copy the site's contact address.",
  "frontend/src/pages/EventsPage.tsx": "Displays community events and includes a form for authenticated users to create new events with validation and error handling.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a searchable, filterable gallery with lightbox viewing, favorites, and upload support for authenticated users.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, intro text, call‑to‑action buttons, and fallback image handling.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Displays a grid of plushie brands with names, descriptions, and specialty badges.",
  "frontend/src/pages/ProfilePage.tsx": "Profile view with loading states, follow/like toggles, editing mode, and user details display.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Shows a directory of public profiles with avatars, bios, and links to individual profile pages.",
  "frontend/src/pages/SupportPage.tsx": "Support page allowing users to submit supporter requests and admins to approve or revoke supporters.",
  "frontend/src/utils/actorError.ts": "Normalizes various backend error types into simplified user messages and includes helpers to detect stopped-canister and sanitize raw error text.",
  "frontend/src/utils/galleryMedia.ts": "Defines static and uploaded gallery item models, converts backend items, merges lists, and supports search and favorites filtering.",
  "frontend/src/utils/imageAttachment.ts": "Validates image files, converts them to byte data, formats file sizes, and exposes accepted types for upload handling.",
  "frontend/src/utils/linkifyText.ts": "Parses text into tokens for plain text, links, and video embeds using URL detection and cleanup logic.",
  "frontend/src/utils/profileImages.ts": "Converts files to bytes or ExternalBlob, creates and revokes preview URLs, and retrieves direct blob URLs for display.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks reachability of static assets using HEAD with GET fallback and handles network or CORS failures.",
  "frontend/src/utils/urlParams.ts": "Gets, stores, and clears URL parameters with session persistence and hash‑based routing support.",
  "frontend/src/utils/videoAttachment.ts": "Validates video files against accepted types and size limits and formats file sizes.",
  "frontend/src/utils/videoEmbeds.ts": "Detects YouTube or Vimeo URLs and extracts embed information for supported video formats.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, extended color variables, container settings, shadows, and animations using multiple plugins.",
  "project_state.json": "Project metadata describing gallery upload features, their status, requirements, and overall state for mixed image/video gallery development."
}