{
  "backend/main.mo": "Implements supporter request management, supporter approvals, and user profile storage with access control, using map-based state and authorization mixins.",
  "feature_evidence.json": "Defines feature evidence entries mapping features to related frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Lists concise descriptions of various frontend files and their roles in the application.",
  "frontend/index.css": "Configures Tailwind CSS base layers and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, age gate, and overall app layout.",
  "frontend/src/components/AgeGate.tsx": "Displays an 18+ confirmation gate using localStorage and conditionally renders children.",
  "frontend/src/components/AuthControls.tsx": "Provides authentication UI, admin claim handling, and profile navigation based on identity and actor state.",
  "frontend/src/components/community/LinkifiedText.tsx": "Converts text into link and video tokens and renders them safely with whitespace preserved.",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Displays pending moderation items with approve/reject actions and error/loading states.",
  "frontend/src/components/community/PollCard.tsx": "Shows an individual poll with voting UI, results, and supporter indicators.",
  "frontend/src/components/community/PollsSection.tsx": "Lists polls and provides a form for authenticated users to create new polls with options.",
  "frontend/src/components/community/PostActions.tsx": "Offers edit and delete dialogs for posts, handling form state and action submission.",
  "frontend/src/components/community/PostComments.tsx": "Renders comments for a post, handles loading, posting new comments, backend errors, and toggling visibility.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Displays an attached image by converting byte data to a Blob URL and cleaning it up on unmount.",
  "frontend/src/components/community/PostLikeButton.tsx": "Shows a like button with count, handles like/unlike mutations, authentication checks, and backend-unavailable states.",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Embeds a video attachment using a direct blob URL and renders a video player with multiple format sources.",
  "frontend/src/components/community/VideoEmbed.tsx": "Renders a responsive 16:9 iframe for safe video embeds from allow‑listed providers.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Implements a fullscreen lightbox for gallery items with navigation, keyboard controls, favorites, and optional deletion.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Provides a dialog to upload image or video files with validation, progress tracking, and backend upload integration.",
  "frontend/src/components/Layout.tsx": "Defines the main site layout with header, navigation, outlet content, and footer.",
  "frontend/src/components/LoadingState.tsx": "Renders a loading spinner and message for pending UI states.",
  "frontend/src/components/Nav.tsx": "Provides responsive navigation with desktop buttons and a mobile sheet menu.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Handles avatar upload with validation, preview generation, ExternalBlob conversion, and removal controls.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Profile editor UI allowing users to create or update display name, bio, avatar, links, plushie images, and visibility, with save handling and validation.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Editor for uploading, previewing, and removing multiple plushie images, converting files to blobs and maintaining preview URLs.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a grid of plushie images using their direct URLs.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Renders a list of external profile links, ensuring URLs are properly prefixed and safe.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "UI badge component showing a decorative supporter label with a heart icon.",
  "frontend/src/content/articles.ts": "Defines article metadata and content, exporting a list of plushie-themed articles.",
  "frontend/src/content/events.ts": "Empty content module for events.",
  "frontend/src/content/teddyStorybook.ts": "Exports a short illustrated storybook entry about Teddy's forest adventure.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages the backend actor based on Internet Identity, handling access control and query invalidation.",
  "frontend/src/hooks/useAssistantChat.ts": "Hook managing assistant chat messages, session state, localStorage persistence, and quick actions.",
  "frontend/src/hooks/useGalleryFavorites.ts": "Hook for storing and toggling gallery favorites using localStorage.",
  "frontend/src/hooks/useGalleryMediaQueries.ts": "React Query hooks for listing, uploading, and deleting gallery media items using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity auth using AuthClient, handling login state and restoring identities.",
  "frontend/src/hooks/useProfileQueries.ts": "Defines React Query hooks for fetching and updating user profiles, including directory listings and caller-specific profile operations.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for posts, moderation, admin checks, and related mutations using an actor-based backend interface.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Exposes a query hook to check if a static asset URL is reachable using a robust availability check.",
  "frontend/src/hooks/useSupporterQueries.ts": "Provides hooks for supporter-related queries and mutations, including listing supporters, checking status, and managing supporter requests.",
  "frontend/src/index.css": "Tailwind-based global styles defining a light-themed color palette and base element styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission, values, offerings, and guidelines using cards and icons.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Displays a grid of adult pacifier brands with descriptions and specialties plus an info section.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Shows a full article with metadata, back navigation, and paragraph rendering based on slug.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles with category, read time, summaries, and links to detail pages.",
  "frontend/src/pages/ColoringPage.tsx": "Empty placeholder page with no content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements a full community board with post creation, media attachments, listing, editing, and moderation.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form and email copy function for reaching site support.",
  "frontend/src/pages/EventsPage.tsx": "Allows users to list and create events with validation, backend integration, and formatted display.",
  "frontend/src/pages/GalleryPage.tsx": "Implements a searchable, filterable gallery with favorites, lightbox navigation, and admin/user delete actions using multiple hooks.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, navigation buttons, and promotional content for the plushie community.",
  "frontend/src/pages/PlushieAssistantPage.tsx": "Provides a chat UI for the assistant with message history, quick actions, auto‑scrolling, and clear‑history dialog.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Displays a grid of predefined plushie brands with descriptions and specialties.",
  "frontend/src/pages/ProfilePage.tsx": "Handles viewing and editing user profiles with follow/like actions, authentication checks, and conditional edit/create states.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Displays the public profiles directory with loading/error states and navigation for viewing or creating profiles based on authentication.",
  "frontend/src/pages/SupportPage.tsx": "Implements supporter request submission, admin approval workflows, and displays supporter data with authentication checks.",
  "frontend/src/utils/actorError.ts": "Normalizes backend errors into readable messages and sanitizes low‑level error details.",
  "frontend/src/utils/galleryMedia.ts": "Defines gallery item types, static and storybook items, and helpers to convert, merge, and filter gallery media.",
  "frontend/src/utils/imageAttachment.ts": "Provides image file validation, conversion to byte data, and utility helpers for size and type handling.",
  "frontend/src/utils/linkifyText.ts": "Parses text into tokens for URLs and video embeds, normalizing and cleaning detected links.",
  "frontend/src/utils/plushieAssistant.ts": "Defines session state and intent detection for a plushie assistant, including care tips, fun facts, and a recommendation flow.",
  "frontend/src/utils/profileImages.ts": "Provides utilities for converting files to bytes or ExternalBlob, generating preview URLs, and obtaining blob direct URLs.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks reachability of static assets using HEAD with GET fallback and abort-controlled fetch.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter extraction, session persistence, and safe removal of parameters from hash routing.",
  "frontend/src/utils/videoAttachment.ts": "Validates video uploads by type and size and includes a helper for formatting file sizes.",
  "frontend/src/utils/videoEmbeds.ts": "Detects and normalizes YouTube or Vimeo URLs into structured embed descriptors.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, fonts, shadows, and plugins including typography, container queries, and animations.",
  "project_state.json": "Tracks project state, features, and pending requests for a member image gallery system."
}