{
  "backend/main.mo": "Motoko canister implementing authorization, blob storage, supporter request/approval flow, and user profile CRUD logic using access control checks.",
  "feature_evidence.json": "Feature evidence report listing video‑embed related enhancements, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light/dark themes and applying global background/foreground styles.",
  "frontend/index.html": "Minimal HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React routing configuration using TanStack Router with app‑wide providers and all top‑level routes.",
  "frontend/src/components/AgeGate.tsx": "Age‑verification wrapper that blocks content until users confirm they are 18+, storing the result in localStorage.",
  "frontend/src/components/AuthControls.tsx": "Authentication UI handling II login, admin claim attempts, and profile display with error handling and dropdown actions.",
  "frontend/src/components/community/LinkifiedText.tsx": "Parses text into tokens and renders links, video embeds, and plain text safely.",
  "frontend/src/components/community/PollCard.tsx": "Displays a poll with voting UI, results, supporter badge, and backend error handling.",
  "frontend/src/components/community/PollsSection.tsx": "Lists polls and provides a form for creating new polls with validation and limits.",
  "frontend/src/components/community/PostActions.tsx": "Provides edit and delete dialogs for posts with form handling and state control.",
  "frontend/src/components/community/PostComments.tsx": "Shows expandable comments section with loading, errors, and a form to add comments.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Displays an optional image attachment by converting byte data to a Blob URL with cleanup handling.",
  "frontend/src/components/community/PostLikeButton.tsx": "Renders a like button that fetches like status, handles like/unlike mutations, and manages authentication and backend errors.",
  "frontend/src/components/community/VideoEmbed.tsx": "Embeds responsive 16:9 iframe videos for approved providers using a descriptor object.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout with header navigation, content outlet, and footer.",
  "frontend/src/components/LoadingState.tsx": "Displays a centered loading spinner and optional message.",
  "frontend/src/components/Nav.tsx": "Renders desktop and mobile navigation menus with active state handling.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Empty file.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Empty file.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Empty file.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a grid of profile images using their direct URLs.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Renders a list of external profile links, ensuring valid URL formatting.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "Renders a styled supporter badge with a heart icon.",
  "frontend/src/content/articles.ts": "Defines the Article type and provides a list of article metadata and full content.",
  "frontend/src/content/events.ts": "Empty file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to identity changes, invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, storage, and client creation.",
  "frontend/src/hooks/useProfileQueries.ts": "Defines React Query hooks for fetching and updating user profiles, directory listings, and follow summaries.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for posts, events, admin checks, and CRUD operations using an actor, with automatic cache invalidation.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Defines a query hook to check if a static asset exists using a HEAD/GET fallback strategy with caching.",
  "frontend/src/hooks/useSupporterQueries.ts": "Implements supporter-related queries and mutations, including supporter lists, requests, approvals, and derived helper checks.",
  "frontend/src/index.css": "Sets Tailwind base styles and a plush pastel-themed design system using custom CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the community mission, values, offerings, and guidelines using card components.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Displays a curated list of adult pacifier brands with summaries and specialties, plus an overview section.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Shows a single article based on its slug, including metadata, navigation, and formatted content rendering.",
  "frontend/src/pages/ArticlesPage.tsx": "Renders a grid of article cards using metadata and links to individual article pages.",
  "frontend/src/pages/ColoringPage.tsx": "Empty page file with no implementation.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements a community board with post creation, editing, deletion, image uploads, and comment/like features.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that opens a mail client and includes an email copy-to-clipboard feature.",
  "frontend/src/pages/EventsPage.tsx": "Lists events and allows authenticated users to create new events with validation and backend error handling.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a static gallery of plushie images with titles and descriptions.",
  "frontend/src/pages/HomePage.tsx": "Home landing page featuring a hero section, navigation buttons, and introductory content for the site.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Renders a grid of plushie brand cards with names, descriptions, and specialties, plus an info section explaining the list.",
  "frontend/src/pages/ProfilePage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Displays a card indicating that the profiles directory is currently unavailable.",
  "frontend/src/pages/SupportPage.tsx": "Implements supporter request submission and admin approval UI using related hooks, with form handling and error normalization.",
  "frontend/src/utils/actorError.ts": "Provides utilities to normalize backend errors into simplified user-friendly messages.",
  "frontend/src/utils/imageAttachment.ts": "Offers functions for validating and converting image files, including size/type checks and formatting helpers.",
  "frontend/src/utils/linkifyText.ts": "Parses text into tokens representing plain text, links, or video embeds using URL detection.",
  "frontend/src/utils/profileImages.ts": "Handles conversion of files to bytes or ExternalBlob plus helpers for preview URLs and blob display URLs.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks whether a static asset is reachable via HEAD or GET fallback with abort logic.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters (including hash routes), storing them in sessionStorage, and retrieving or clearing persisted values.",
  "frontend/src/utils/videoEmbeds.ts": "Parses YouTube and Vimeo URLs to detect supported video embeds and returns normalized embed descriptors.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending typography, colors, layout, and animations with custom themes and plugins.",
  "project_state.json": "Tracks project metadata, existing features, and pending requests related to implementing video embeds."
}