{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, a public directory, and legacy post and event CRUD with storage mixins.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file's purpose and behavior.",
  "frontend/index.css": "Tailwind base setup defining light and dark theme CSS variables and global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, age gate, and global toaster for the app.",
  "frontend/src/components/AgeGate.tsx": "Age‑verification wrapper that blocks access until the user confirms they are 18+.",
  "frontend/src/components/AuthControls.tsx": "Handles Internet Identity login, profile display, admin claiming, and sign‑out menu.",
  "frontend/src/components/community/PostActions.tsx": "Provides edit and delete controls for posts, including dialogs for editing fields and confirming deletion.",
  "frontend/src/components/community/PostComments.tsx": "Displays expandable comments section with comment count, input form, and comment listing fetched from queries.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Renders an optional image attachment by converting bytes to a Blob URL and cleaning it up on change.",
  "frontend/src/components/community/PostLikeButton.tsx": "Shows a like button with count and toggles likes via authenticated mutations.",
  "frontend/src/components/Layout.tsx": "Global layout with header, nav, auth controls, routed content area, and footer.",
  "frontend/src/components/LoadingState.tsx": "Reusable loading indicator with a spinning icon and message.",
  "frontend/src/components/Nav.tsx": "Responsive navigation bar rendering desktop links and a mobile sheet menu with active‑route highlighting.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Empty file.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Empty file.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Empty file.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Displays a grid of profile images using direct URLs from ExternalBlob objects.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Renders a list of external profile links, ensuring URLs are safe and opening them in new tabs.",
  "frontend/src/content/articles.ts": "Defines Article type and exports an array of article metadata and full content strings.",
  "frontend/src/content/events.ts": "Empty file.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, creating and managing identities with AuthClient.",
  "frontend/src/hooks/useProfileQueries.ts": "Defines React Query hooks for fetching, editing, and managing user profiles and follow data via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for posts, events, likes, and admin checks, including create, edit, delete, and list operations.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "Offers a query hook that checks if a static asset URL is reachable using a HEAD/GET fallback strategy.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables defining a soft pastel color palette for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page highlighting mission, community values, offerings, and guidelines using card UI components.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article by slug with metadata, content rendering, and navigation back to the article list.",
  "frontend/src/pages/ArticlesPage.tsx": "Renders a grid of article cards with category, read time, and links to article detail pages.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements a community board with post listing, creation, editing, deletion, image uploads, and authentication checks.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that opens an email client and includes a copy‑to‑clipboard email field.",
  "frontend/src/pages/EventsPage.tsx": "Displays community events and includes a form for authenticated users to create new events with date and time validation.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a static grid gallery of plushie images with titles and descriptions.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero section, navigation links, static asset checks, and featured community info.",
  "frontend/src/pages/ProfilePage.tsx": "Profile view page that loads a user's profile data, follow/like summaries, and enables toggling follow/like actions with authentication checks.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Directory page listing public user profiles with avatars and bios, including loading and error states.",
  "frontend/src/utils/actorError.ts": "Utility that converts backend error messages into friendly, contextual strings.",
  "frontend/src/utils/imageAttachment.ts": "Helpers for validating, converting, and formatting image files for uploads with size/type checks.",
  "frontend/src/utils/profileImages.ts": "Utilities for converting files to ExternalBlob, previewing images, and retrieving blob URLs.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks whether a static asset is reachable using HEAD and GET fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, and animations for the frontend theme.",
  "project_state.json": "Defines project state, theme updates, UI/branding rules, moderation logic, profile behavior, and upcoming features. Lists known issues such as broken PDF downloads and missing images."
}