{
  "backend/main.mo": "Implements user profile CRUD with access control and blob storage plus legacy post and event handling.",
  "backend/migration.mo": "Migrates old userProfiles to the new profile format with added fields and defaults.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Plain-text JSON-like mapping of frontend file paths to short descriptive summaries.",
  "frontend/index.css": "Global Tailwind-based theme variables and dark mode styles for the frontend.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theming, age gate, layout, and root application structure.",
  "frontend/src/components/AgeGate.tsx": "Age-verification component enforcing 18+ access with localStorage persistence.",
  "frontend/src/components/AuthControls.tsx": "Authentication UI with Internet Identity login, admin-claim action, and account dropdown.",
  "frontend/src/components/community/PostActions.tsx": "Implements edit and delete controls for posts with dialogs and state handling.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Displays an optional post image by converting byte data to a blob URL with cleanup.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with header, navigation, content outlet, and footer.",
  "frontend/src/components/LoadingState.tsx": "Renders a centered loading spinner with an optional message.",
  "frontend/src/components/Nav.tsx": "Provides responsive navigation with active link highlighting and a mobile sheet menu.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Empty file.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Empty file.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Empty file.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Empty file.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Empty file.",
  "frontend/src/content/articles.ts": "Defines the Article type and exports static article data with content.",
  "frontend/src/content/events.ts": "Empty file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, state, and AuthClient setup.",
  "frontend/src/hooks/useProfileQueries.ts": "Contains React Query hooks for listing, fetching, and saving user profiles via the actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for listing, creating, editing, and deleting posts and events, plus checking admin status. Wraps actor API calls and invalidates relevant queries on mutations.",
  "frontend/src/index.css": "Defines Tailwind base styles and a plush-themed color palette for light and dark modes. Applies global typography, background, and border styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers. Imports global CSS and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, values, offerings, and guidelines using styled cards and icons. Provides static informational content about the community.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a single article based on slug, with category, read time, summary, and full content. Falls back to a not-found message if the article doesn't exist.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles with category, read time, title, and summary in a grid of cards. Each card links to its detailed article page.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Implements the community board with post listing, creation, editing, deletion, image attachments, and admin controls. Uses Internet Identity authentication and React Query mutations.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that opens an email client on submit and an option to copy the site’s contact email. Includes UI for user input and toast feedback.",
  "frontend/src/pages/EventsPage.tsx": "Displays events, lists existing ones, and provides a form for authenticated users to create new events with validation.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a static grid gallery of plushie-themed images with titles and descriptions.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage hero section, feature highlights, and navigation links with a fallback for hero image loading errors.",
  "frontend/src/pages/ProfilePage.tsx": "Empty placeholder file for an individual profile page.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Lists community profiles with avatars and bios, handling loading, errors, and empty states.",
  "frontend/src/utils/actorError.ts": "Converts backend errors into simplified user-friendly messages with special handling for auth and validation issues.",
  "frontend/src/utils/imageAttachment.ts": "Provides image file validation, conversion, and size/type checks for uploads.",
  "frontend/src/utils/profileImages.ts": "Handles file-to-blob conversion, preview URLs, and retrieving direct URLs for profile images.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, container settings, animations, and plugin integrations for the site's theme.",
  "project_state.json": "Defines the project’s state, design directions, feature list, and known UI issues for the Plushie Haven website."
}