{
  "backend/main.mo": "Main backend actor implementing supporter request/approval system, user profiles with avatar/plushie images, blob storage integration, and access control with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting removal of community and gallery sections from HomePage component with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and content with details on routing, authentication, gallery, community board, events, and styling.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for backgrounds, foregrounds, borders, and component colors.",
  "frontend/index.html": "HTML entry point for Plushie Haven application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration defining all routes (home, articles, gallery, community, events, profiles, admin pages) with role guards for admin routes, theme provider, age gate, and session timeout integration.",
  "frontend/src/components/AgeGate.tsx": "Age verification component displaying 18+ confirmation dialog on first visit, storing confirmation in localStorage, and blocking access if user declines.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-page access denied screen showing role requirements, current user role, and navigation options (sign in or return home).",
  "frontend/src/components/auth/RoleGuard.tsx": "Route guard component that checks user role against required role using hierarchy system and displays AccessDeniedScreen or custom fallback if unauthorized.",
  "frontend/src/components/AuthControls.tsx": "Authentication dropdown component displaying user identity/profile with role badge, providing profile view/edit navigation, admin claim functionality, and logout with cache clearing.",
  "frontend/src/components/community/LinkifiedText.tsx": "Text renderer that converts URLs to clickable links and embeds videos using token-based parsing without dangerouslySetInnerHTML.",
  "frontend/src/components/community/ModerationQueuePanel.tsx": "Admin panel for reviewing flagged posts in moderation queue with approve/reject actions, displaying post content, video attachments, and timestamps.",
  "frontend/src/components/community/PollCard.tsx": "Poll display and voting component showing question, options with vote counts/percentages, voting UI for authenticated users, and supporter badges for creators.",
  "frontend/src/components/community/PollsSection.tsx": "Displays community polls with voting functionality and a form to create new polls. Handles authentication, supporter-based option limits (4 for regular users, 10 for supporters), and backend unavailability errors.",
  "frontend/src/components/community/PostActions.tsx": "Provides edit and delete actions for community posts with modal dialogs. Includes form inputs for editing post title, body, and optional author name with validation.",
  "frontend/src/components/community/PostComments.tsx": "Displays expandable comments section for posts with comment creation form. Handles authentication, backend unavailability, and shows comment count with formatted timestamps.",
  "frontend/src/components/community/PostImageAttachment.tsx": "Renders image attachments for posts using ExternalBlob's direct URL for streaming and caching. Returns null if no image is provided.",
  "frontend/src/components/community/PostLikeButton.tsx": "Implements like/unlike functionality for posts with heart icon and count display. Handles authentication checks, backend unavailability, and optimistic UI updates.",
  "frontend/src/components/community/PostVideoAttachment.tsx": "Renders video attachments for posts using ExternalBlob's direct URL with multiple format support (mp4, webm, ogg). Includes video controls and metadata preloading.",
  "frontend/src/components/community/VideoEmbed.tsx": "Responsive iframe component for embedding videos from allowlisted providers (YouTube, Vimeo). Maintains 16:9 aspect ratio with safe iframe rendering.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Full-screen modal lightbox for viewing gallery items with navigation controls, keyboard shortcuts, and favorite/delete actions. Supports images, videos, and storybook content with confirmation dialog for deletions.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Dialog component for uploading images or videos to the gallery with title, description, file validation, progress tracking, and error handling using ExternalBlob.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo, navigation, and auth controls, plus a footer with copyright and links. Uses React Router's Outlet for nested routes.",
  "frontend/src/components/LoadingState.tsx": "Reusable loading indicator component displaying an animated spinner with customizable message and styling.",
  "frontend/src/components/Nav.tsx": "Navigation component with desktop and mobile (sheet) variants, including main nav links and conditional admin dropdown menu for users with admin role.",
  "frontend/src/components/profiles/AvatarUploader.tsx": "Component for uploading and managing user avatar images with file validation, preview, and removal functionality using ExternalBlob.",
  "frontend/src/components/profiles/EditProfilePanel.tsx": "Full profile editing panel with display name, bio, avatar, links, plushie images, and public directory toggle; handles both profile creation and updates.",
  "frontend/src/components/profiles/PlushieImagesEditor.tsx": "Component for managing multiple plushie images with upload, preview grid, and individual image removal using ExternalBlob.",
  "frontend/src/components/profiles/ProfileImageGrid.tsx": "Display component that renders a grid of plushie images from ExternalBlob array with hover effects.",
  "frontend/src/components/profiles/ProfileLinksList.tsx": "Component that displays a list of external profile links with icons and safe URL handling.",
  "frontend/src/components/SessionTimeoutWarning.tsx": "Alert dialog that warns users before session expiration with countdown timer and option to extend session.",
  "frontend/src/components/supporter/SupporterBadge.tsx": "Badge component displaying a gradient 'Supporter' label with heart icon.",
  "frontend/src/content/articles.ts": "Static content defining plushie care, display, and collecting guide articles with metadata and full text content.",
  "frontend/src/content/events.ts": "Empty module for event-related content (no exports or content defined).",
  "frontend/src/content/teddyStorybook.ts": "Static storybook content defining 'Teddy's Little Forest Adventure' with title, description, cover image, and story text.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAssistantChat.ts": "Provides chat functionality for a plushie assistant with message history persistence to localStorage, session state management, and predefined quick action prompts.",
  "frontend/src/hooks/useGalleryFavorites.ts": "Manages a set of favorited gallery item IDs with localStorage persistence, providing toggle and check functions for favorite status.",
  "frontend/src/hooks/useGalleryMediaQueries.ts": "Provides React Query hooks for listing, adding, and deleting gallery media items (images/videos) with automatic cache invalidation and actor availability checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login/logout flows, identity persistence, and authentication state with configurable AuthClient options.",
  "frontend/src/hooks/useProfileQueries.ts": "Provides React Query hooks for fetching and saving user profiles, including directory listings, individual profile views, and caller's own profile with automatic cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for post management (create, edit, delete, list) with counts, admin checks, and actor availability validation using mutation and query patterns.",
  "frontend/src/hooks/useSessionTimeout.ts": "React hook that manages automatic session timeout with configurable inactivity period (default 30 minutes), shows warning before logout, tracks user activity events, and persists last activity in sessionStorage.",
  "frontend/src/hooks/useStaticAssetAvailability.ts": "React Query hook that checks if a static asset URL is available using a HEAD request with GET fallback strategy, caching results for 5 minutes.",
  "frontend/src/hooks/useSupporterQueries.ts": "Collection of React Query hooks for managing supporter functionality including fetching supporters, checking supporter status, submitting/approving supporter requests, and revoking supporter access with proper cache invalidation.",
  "frontend/src/hooks/useUserRole.ts": "React Query hooks for fetching user roles and checking permissions (admin, moderator) with role hierarchy comparison logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette featuring baby blue and pastel pink theme for both light and dark modes, maintaining a soft, cozy aesthetic throughout.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Static page describing Plushie Haven's mission, community values, offerings, and guidelines for adult plushie enthusiasts with icon-decorated cards.",
  "frontend/src/pages/AdminUserManagementPage.tsx": "Admin page placeholder for user management with search UI and alert indicating backend implementation is required for user listing, role assignment, and deletion features.",
  "frontend/src/pages/AdultPacifierBrandsPage.tsx": "Static informational page displaying a grid of 10 adult pacifier brands with descriptions, specialty badges, and explanatory content about the curated list.",
  "frontend/src/pages/AnalyticsDashboardPage.tsx": "Displays an analytics dashboard with metrics for posts, comments, likes, events, supporters, gallery items, and polls using multiple data hooks and metric cards.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Renders a single article detail page by slug parameter, displaying title, category, read time, and formatted content paragraphs.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles in a grid layout with cards showing category badges, read time, title, and summary with links to detail pages.",
  "frontend/src/pages/AuditLogPage.tsx": "Placeholder page for audit logs with search UI and alert indicating backend implementation is required for tracking administrative actions.",
  "frontend/src/pages/ColoringPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CommunityBoardPage.tsx": "Community board page with post creation form supporting image/video attachments, post listing with likes/comments, polls section, and moderation queue panel for admins.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a form that opens email client with pre-filled message and a copy-to-clipboard button for the contact email address.",
  "frontend/src/pages/EventsPage.tsx": "Events page with form to create events (title, description, location, start/end times) and displays list of existing events with formatted dates and locations.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page component that displays a searchable, filterable grid of media items (static, storybook, and uploaded) with lightbox viewing, favorites, authentication-gated uploads, and admin-only deletion capabilities. Includes connection warning alerts and accessibility features like keyboard navigation and focus management.",
  "frontend/src/pages/HomePage.tsx": "Landing page component featuring a hero section with logo and description, a \"Plushie Moments\" section, and navigation to articles. Includes fallback handling for hero image errors.",
  "frontend/src/pages/ModerationDashboardPage.tsx": "Admin moderation dashboard for reviewing pending community content (posts and gallery items) with approve/reject actions. Displays content in tabs with image/video attachment previews and formatted timestamps.",
  "frontend/src/pages/PlushieAssistantPage.tsx": "Chat interface page for the Plushie Pal AI assistant with message history, quick action buttons, auto-scrolling, and clear history functionality. Supports Enter-to-send and Shift+Enter for multiline input.",
  "frontend/src/pages/PlushieBrandsPage.tsx": "Static informational page displaying a grid of popular plushie brands with descriptions and specialty badges (Collectible, Premium, Heritage, etc.). Includes an explanatory section about the curated list.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user profile page with follow/like functionality, profile images, links, and an edit mode for the owner. Handles authentication, loading states, and empty states for new profiles.",
  "frontend/src/pages/ProfilesDirectoryPage.tsx": "Shows a directory of public community profiles in a grid layout. Includes empty states and a create profile button for authenticated users.",
  "frontend/src/pages/SupportPage.tsx": "Manages supporter requests and approvals with forms for submission and admin controls for approval/revocation. Displays external monetization links and supporter status.",
  "frontend/src/pages/SystemSettingsPage.tsx": "Placeholder page for system-wide settings with tabs for features, content limits, moderation, and session configuration. Shows alerts indicating backend implementation is required.",
  "frontend/src/utils/actorError.ts": "Normalizes backend errors into user-friendly messages, handling stopped canisters, authorization failures, moderation blocks, and actor connection states. Includes message sanitization to remove internal IDs.",
  "frontend/src/utils/galleryMedia.ts": "Defines types and helpers for a unified gallery feed that merges static images, a storybook item, and user-uploaded media items from the backend. Includes conversion, merging, and search filtering functions.",
  "frontend/src/utils/imageAttachment.ts": "Provides utilities for handling image attachments with validation for file type, size (2MB limit), and conversion of File objects to Uint8Array with metadata.",
  "frontend/src/utils/inputValidation.ts": "Contains validation functions for text length, usernames, URLs, file uploads, and detection of dangerous HTML/script content in user input.",
  "frontend/src/utils/linkifyText.ts": "Parses text to detect URLs and video embeds, returning structured tokens (text, link, video) for safe rendering without generating raw HTML.",
  "frontend/src/utils/plushieAssistant.ts": "Implements a conversational assistant for plushie recommendations, stories, care tips, and fun facts with intent detection and multi-step recommendation flows.",
  "frontend/src/utils/profileImages.ts": "Provides functions to convert File objects to Uint8Array and ExternalBlob for profile images, plus helpers for creating and revoking preview URLs.",
  "frontend/src/utils/sanitization.ts": "Offers sanitization utilities including HTML stripping, HTML escaping, URL sanitization (allowing only http/https), and whitespace normalization.",
  "frontend/src/utils/staticAssetCheck.ts": "Checks if a static asset URL is reachable by attempting a HEAD request first, then falling back to an aborted GET request if HEAD is unsupported.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/videoAttachment.ts": "Defines video file validation utilities including accepted video types (MP4, WebM, OGG, MOV), a 100MB size limit, and functions to validate files and format file sizes.",
  "frontend/src/utils/videoEmbeds.ts": "Detects and generates embed URLs for YouTube and Vimeo videos from various URL formats, returning structured video embed descriptors.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Quicksand, Nunito, Inter), shadow utilities, and animation keyframes.",
  "project_state.json": "Project state tracking file indicating completed features to remove community and gallery sections from the HomePage component."
}