{
  "kind": "build_request",
  "title": "Add video embeds for supported video links",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the existing URL parsing/rendering used by Community Board posts and comments to auto-embed videos for supported video URLs (at minimum YouTube and Vimeo) while keeping all other URLs rendered as normal clickable external links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add video embeds"
        ]
      },
      "acceptanceCriteria": [
        "When a user includes a YouTube or Vimeo URL in post titles, post bodies, or comment content, the UI renders an embedded video player for that URL.",
        "Non-video URLs continue to render as clickable links (open in a new tab) exactly as they do today.",
        "Embeds are implemented using a strict allowlist of video providers (e.g., YouTube/Vimeo) and do not allow arbitrary iframe embedding.",
        "Embedded players are responsive (maintain aspect ratio and fit the container on mobile/desktop)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply video-embed rendering consistently anywhere the app currently uses LinkifiedText to render user-generated text (including CommunityBoardPage post title/body and PostComments comment content).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add video embeds"
        ]
      },
      "acceptanceCriteria": [
        "CommunityBoardPage renders video embeds in post titles and post bodies where applicable.",
        "PostComments renders video embeds in comment content where applicable.",
        "No changes are required to backend data structures or APIs to support video embedding (embeds are derived from existing text content)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*).",
    "Do not use dangerouslySetInnerHTML for embedding; use safe, token-based rendering and a provider allowlist."
  ],
  "nonGoals": [
    "Uploading/hosting video files in the app or storing video blobs on the backend.",
    "Embedding videos from arbitrary/untrusted domains.",
    "Adding real-time video features (live streaming, chat, etc.)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}