{
  "kind": "build_request",
  "title": "Fix “Create My Public Profile” button to open profile creation form and redirect to profile page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the “Create My Public Profile” button on the “No Public Profiles Yet” empty state so that clicking it reliably navigates the authenticated user to their own profile route in edit mode (opening the profile creation form).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "add a create my public profile dont work",
          "create my profile button doesnt work",
          "nothing, profile creation form,  profile page"
        ]
      },
      "acceptanceCriteria": [
        "When the profiles directory is empty and the user is authenticated, clicking “Create My Public Profile” navigates to `/profiles/<callerPrincipal>?edit=true`.",
        "If the user is not authenticated, the UI continues to show a sign-in call-to-action instead of attempting navigation.",
        "No console errors occur when clicking the button."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the profile page logic so that when the authenticated user navigates to their own profile with `edit=true` and no profile exists yet, the page shows the EditProfilePanel (profile creation form) immediately instead of showing the intermediate “Create Your Profile” empty state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "nothing, profile creation form,  profile page"
        ]
      },
      "acceptanceCriteria": [
        "Given an authenticated user with no saved profile, visiting `/profiles/<callerPrincipal>?edit=true` renders the profile editor form (EditProfilePanel) directly.",
        "The “Create Your Profile” empty state is only shown when `edit` is not set (or is false)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure that after successfully saving a newly created profile from the profile creation form, the app redirects the user to their profile page view (non-edit mode) so they can see the created profile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "nothing, profile creation form,  profile page"
        ]
      },
      "acceptanceCriteria": [
        "After a successful save from the creation form, the route becomes `/profiles/<callerPrincipal>` (no `edit=true` in the URL).",
        "The saved profile content is displayed on the profile page immediately after redirect (no manual refresh required)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or other paths listed in frontend.immutablePaths.",
    "Keep the backend single-actor architecture (no additional canisters/services)."
  ],
  "nonGoals": [
    "Adding new profile fields or changing the profile data model.",
    "Changing the public profiles directory design beyond what is required to make the creation flow work.",
    "Adding third-party authentication providers (Internet Identity only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}