{
  "kind": "build_request",
  "title": "Add uploaded coloring pages to the Coloring Book PDF",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-60",
      "text": "Update the static coloring book PDF served at the exact URL `/assets/coloring-book.pdf` to include the two user-uploaded images as additional coloring pages: `colorifyai-1770544927646.png` and `colorifyai-1770544979559.png`. The updated PDF must preserve clean black-and-white line art (no unexpected color fills) and print cleanly on letter/A4 pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add this to color book"
        ]
      },
      "acceptanceCriteria": [
        "Visiting `/assets/coloring-book.pdf` in the browser successfully loads a PDF (HTTP 200) in a deployed build.",
        "The PDF contains two additional pages that match the uploaded images (bear plush line art and the creature with hat/flowers line art).",
        "The added pages are high-contrast black line art on white background with no unintended background tinting or compression artifacts that make lines blurry when printed.",
        "The Home page download button continues to open the updated PDF in a new tab via the existing link `/assets/coloring-book.pdf`."
      ]
    },
    {
      "id": "REQ-61",
      "text": "Add the two uploaded source images to the frontend static assets (so the project retains the originals used to build the PDF) without changing their filenames: `colorifyai-1770544927646.png` and `colorifyai-1770544979559.png`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add this to color book"
        ]
      },
      "acceptanceCriteria": [
        "Both PNG files are present in the deployed frontend static files and can be fetched directly by the browser at their committed static-asset paths.",
        "The committed filenames exactly match: `colorifyai-1770544927646.png` and `colorifyai-1770544979559.png`."
      ]
    }
  ],
  "constraints": [
    "Do not change any immutable frontend paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/main.tsx`, `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, `frontend/src/components/ui`).",
    "Keep the coloring book download URL exactly `/assets/coloring-book.pdf` (do not change the route, filename, or query params).",
    "Do not introduce any new backend canisters or external storage/services; this is a frontend static-asset update."
  ],
  "nonGoals": [
    "Redesigning the Home page Coloring Book CTA UI/wording (beyond ensuring it continues to work).",
    "Adding a PDF viewer page or in-app preview experience.",
    "Changing any unrelated plushie images, theme tokens, or other site content."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}