{
  "kind": "build_request",
  "title": "Implement user profiles (display name, bio, avatar, links, plushie images) with Internet Identity",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add Profiles routes to the TanStack Router, including a profiles directory route and an individual profile route that supports viewing a profile by principal string.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bulid it"
        ]
      },
      "acceptanceCriteria": [
        "The app has a working route for a profiles directory page (e.g., /profiles).",
        "The app has a working route for viewing a specific user profile by principal (e.g., /profiles/$principal).",
        "Navigation to these routes works without full page reloads and does not break existing routes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the current “Profiles Currently Unavailable” placeholder with a functional Profiles Directory page that lists public directory profiles from the backend and links to each profile view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bulid it"
        ]
      },
      "acceptanceCriteria": [
        "Profiles directory uses the existing React Query hook for directory listing (listDirectoryProfiles) and renders a non-empty state when profiles exist.",
        "Each listed profile entry shows at least display name and (if available) avatar, and links to that user’s profile page.",
        "Page shows a clear empty state message when there are zero public profiles.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement the Profile page UI to view a user profile (avatar, display name, bio, links, plushie image grid) and show follow/follower counts and profile like count with Like/Unlike and Follow/Unfollow actions for authenticated users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bulid it"
        ]
      },
      "acceptanceCriteria": [
        "Profile page fetches the profile by principal via existing hook and handles invalid/missing principal by showing an English error/empty state.",
        "Profile page renders avatar (or a fallback), display name, bio, links list, and plushie images grid when present.",
        "Profile page shows follower/following counts and like count using existing hooks.",
        "Authenticated users can Follow/Unfollow and Like/Unlike from the profile page; unauthenticated users see a sign-in prompt and controls are disabled/hidden appropriately.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement an owner-only profile editing experience for the signed-in user, allowing editing and saving of all profile fields: display name, bio, avatar image, links, plushie images, and public directory opt-in.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yes all"
        ]
      },
      "acceptanceCriteria": [
        "Signed-in user can open an Edit Profile UI that is prefilled using getCallerUserProfile.",
        "Edit Profile supports editing: display name, bio, avatar image, links (url + display name), plushie images (multiple), and publicDirectory toggle.",
        "Saving calls the existing saveCallerUserProfile mutation and shows success/error feedback in English.",
        "After saving, the caller profile query and directory listing are refreshed (via existing invalidations).",
        "If the user is not signed in, the edit UI is not accessible and an English sign-in prompt is shown instead."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement the missing profile editor components (AvatarUploader, PlushieImagesEditor, EditProfilePanel) with file validation, local previews, and conversion to ExternalBlob, using the existing utilities in the codebase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yes all"
        ]
      },
      "acceptanceCriteria": [
        "AvatarUploader supports selecting a single image file, validates allowed image types/sizes using existing utilities, shows a preview, and outputs an ExternalBlob for saving.",
        "PlushieImagesEditor supports adding/removing multiple image files, shows previews, and outputs an array of ExternalBlobs for saving.",
        "EditProfilePanel composes AvatarUploader, PlushieImagesEditor, and link editing controls into a single coherent form with Save/Cancel behavior.",
        "Preview URLs are revoked/cleaned up to avoid memory leaks.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Expose Profiles navigation entry points in the UI so users can find the profiles directory and their own profile easily.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bulid it"
        ]
      },
      "acceptanceCriteria": [
        "Primary navigation includes a “Profiles” link that routes to the profiles directory.",
        "Signed-in users have an obvious way to navigate to their own profile/edit view (e.g., from the auth dropdown or profile page), without modifying immutable hook files.",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them only).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx.",
    "Keep all backend logic within the single Motoko actor (backend/main.mo); only add backend changes if strictly required for profiles."
  ],
  "nonGoals": [
    "Adding third-party authentication providers beyond Internet Identity.",
    "Adding real-time features (websockets/live updates).",
    "Adding external databases or off-chain storage.",
    "Building a marketplace, posting system changes, or moderation changes unrelated to profiles."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}