{
  "kind": "build_request",
  "title": "Member Gallery: Upload and Delete Own Media",
  "projectName": "Member Gallery",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Backend: Ensure authenticated members can add gallery media items (image or video) with optional title/description, and store the item's author so ownership can be enforced later.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make the gallery where members can delete their images",
          "both"
        ]
      },
      "acceptanceCriteria": [
        "When an authenticated user calls the backend method to add a gallery media item, the item is created successfully and is associated with the caller as author.",
        "When an anonymous user calls the backend method to add a gallery media item, the backend rejects the request with an authorization error.",
        "The backend stores optional title and description values (nullable/optional) for each uploaded item."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Backend: Enforce deletion permissions so that only the original author of a gallery media item (or an admin) can delete it.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make the gallery where members can delete their images"
        ]
      },
      "acceptanceCriteria": [
        "If a non-admin authenticated user attempts to delete a gallery media item they did not create, the backend rejects the request with an authorization error.",
        "If the author deletes their own gallery media item, the item is removed from backend state.",
        "If an admin deletes any gallery media item, the item is removed from backend state.",
        "If a user attempts to delete a non-existent gallery media item ID, the backend returns a clear not-found error."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Frontend: Provide a gallery page that lists gallery media items and allows authenticated members to upload new media (image or video) with optional title and description.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "both"
        ]
      },
      "acceptanceCriteria": [
        "When signed in, the user can open an upload dialog, select a supported image or video file, optionally enter a title and description, and successfully upload it.",
        "Upload UI validates file type/size and shows a clear error message when an unsupported file is selected.",
        "After a successful upload, the gallery list refreshes to include the newly uploaded item without requiring a full page reload."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Frontend: Allow members to delete their own uploaded gallery media items from both the gallery grid and the lightbox view, with a confirmation dialog and clear success/error feedback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make the gallery where members can delete their images"
        ]
      },
      "acceptanceCriteria": [
        "For an uploaded item authored by the signed-in user (or when the user is an admin), a delete control is visible in the gallery grid and in the lightbox.",
        "For uploaded items not authored by the signed-in non-admin user, no delete control is shown.",
        "Deleting an item requires a confirmation step and, on confirmation, calls the backend delete method and removes the item from the UI after completion.",
        "If deletion fails (e.g., unauthorized), the UI shows an English error message derived from the backend error and the item remains visible."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Frontend/Backend integration: Ensure the gallery list and delete/upload mutations are wired through React Query so the gallery view remains consistent after changes (upload/delete) and handles actor availability/authentication transitions gracefully.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "both"
        ]
      },
      "acceptanceCriteria": [
        "Gallery list requests are performed via React Query and render a loading state while fetching.",
        "Upload and delete actions invalidate/refetch the gallery list query upon success so the UI reflects backend state.",
        "If the backend actor is not yet available (e.g., during authentication/actor initialization), mutations fail gracefully with an English error message instead of crashing the page."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit any files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "All user-facing text added/changed by this work must be in English."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding real-time updates (WebSockets/push).",
    "Adding external database storage beyond the current canister state and blob storage mechanisms."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}