{
  "kind": "build_request",
  "title": "Add plushie assistant chat bot (scripted, on-device)",
  "projectName": "Plushie Pal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new dedicated \"Plushie Assistant\" chat page that users can access from the main navigation, implemented as an on-device/scripted chat box (no external AI integrations).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ADD AI ASSISTANT BOT FOR PLUSHIES",
          "CHAT BOX"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists (e.g., \"/assistant\") and is registered in the TanStack Router route tree.",
        "The main site navigation includes a new link labeled \"Assistant\" (or \"Plushie Assistant\") that navigates to the assistant page.",
        "The assistant page renders a chat UI with: message list, a text input, and a send button; pressing Enter sends the message.",
        "All user-facing strings on the assistant page are in English.",
        "No network calls to external AI services are made from this feature."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement the plushie assistant’s scripted conversation logic so it can: (1) answer plushie-related facts/care questions, (2) recommend plushies based on user preferences, (3) generate short plushie stories, and (4) maintain a consistent friendly plushie-themed personality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ALL",
          "YES"
        ]
      },
      "acceptanceCriteria": [
        "The assistant supports at least these intents: facts/care Q&A, recommendations, story generation, and general friendly chat/personality responses.",
        "The assistant offers quick-action prompt chips/buttons for the main intents (e.g., \"Care tips\", \"Recommend a plushie\", \"Tell me a story\").",
        "Recommendations ask at least 2 preference questions (e.g., size, texture, animal type, budget) before suggesting options.",
        "Story generation produces a coherent short story (at least ~5 sentences) with plushie-themed tone and optionally asks for a character name/theme to personalize it.",
        "The assistant personality remains consistent across responses (warm, cozy, plushie-themed), without claiming to be a real AI model or using external data."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add basic chat UX safeguards and state handling for the assistant: empty-input prevention, simple session history persistence on the device, and a \"Clear chat\" action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "YES, YES, CHAT BOX"
        ]
      },
      "acceptanceCriteria": [
        "Sending an empty/whitespace-only message is blocked with an inline validation message or toast in English.",
        "Chat history persists across page reloads using on-device storage (e.g., localStorage) and can be cleared by a \"Clear chat\" button with a confirmation step.",
        "The UI handles long messages gracefully (wrapping, scrollable transcript) and keeps the latest message visible after sending.",
        "No backend schema changes or backend calls are required for chat history persistence."
      ]
    }
  ],
  "constraints": [
    "Do not integrate external AI services or LLM APIs; the assistant must be implemented using scripted/on-device logic only.",
    "Do not edit files under frontend/src/components/ui or other frontend immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Respect the existing routing setup (TanStack Router) and existing Tailwind/shadcn UI conventions."
  ],
  "nonGoals": [
    "Voice input/output for the assistant.",
    "Real-time messaging via WebSockets or live agent chat.",
    "Training or fine-tuning an AI model, or using third-party AI providers.",
    "Storing assistant chat logs on the backend or associating them with user identities (unless explicitly requested later)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}