{
  "kind": "build_request",
  "title": "Add user uploads for images and videos to the Gallery (mixed feed)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add backend support for storing and listing user-uploaded Gallery media items (images and videos), so uploaded items can be fetched by the frontend and displayed mixed together in the /gallery feed.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "videos and images 2 upload them  mixed in",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method to list gallery items (including type=image|video, createdAt timestamp, and a blob reference usable by the frontend).",
        "Backend exposes an authenticated update method that allows a signed-in user to create a gallery item with either an image file or a video file stored via the existing blob-storage mixin (Storage.ExternalBlob).",
        "Unauthorized (anonymous) callers cannot upload gallery media (the call traps with an authorization error).",
        "Gallery item IDs are stable and unique.",
        "If persistent state schema changes are required, add a conditional Motoko migration (backend/migration.mo) so existing canister state upgrades safely."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Gallery page UI to allow signed-in users to upload images and videos, and display uploaded items mixed together with the existing gallery content in the same grid.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "videos and images 2 upload them  mixed in",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "/gallery includes an upload entry point (e.g., button opening a dialog/panel) that is only enabled/visible for authenticated users; anonymous users see a clear prompt to sign in to upload.",
        "The upload UI accepts both image and video files and validates files using the existing utilities (frontend/src/utils/imageAttachment.ts and frontend/src/utils/videoAttachment.ts), showing user-friendly validation errors.",
        "After a successful upload, the newly uploaded item appears in the gallery grid without a full page refresh (React Query cache invalidation/refetch).",
        "The gallery grid renders a mixed list of items (existing static items plus uploaded items) together in one feed; search and favorites filtering continue to work on the combined list.",
        "Favorites functionality works for both static and uploaded items (no ID collisions; favorites persist in localStorage)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Extend the gallery lightbox/viewer experience to support both images and videos (in addition to existing image viewing), including keyboard navigation and accessible controls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "videos and images 2 upload them  mixed in",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "Clicking an image item opens the existing lightbox with the image displayed as before.",
        "Clicking a video item opens a lightbox that plays the video with standard controls (play/pause/seek/volume) and does not autoplay by default.",
        "Previous/Next navigation works across the mixed media list (images and videos) using both on-screen buttons and ArrowLeft/ArrowRight keys; Escape closes the lightbox.",
        "The lightbox remains accessible: focus is managed on open/close, controls have appropriate aria-labels, and the overlay can be closed reliably."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not modify files under frontend/src/components/ui or other frontend immutablePaths listed in SYSTEM_CONTEXT; compose them instead.",
    "Use English for all user-facing text.",
    "Do not introduce third-party auth providers; use existing Internet Identity integration."
  ],
  "nonGoals": [
    "Adding categories/albums or separating images vs videos into different gallery sections.",
    "Real-time updates via websockets or live collaboration features.",
    "External database or third-party media hosting integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}