{
  "kind": "build_request",
  "title": "Add AI-assisted moderation to Community Board uploads (block illegal content + manual review queue)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement an on-canister (no external API) AI-assisted moderation check for Community Board post creation that analyzes the post title/body and any attached video metadata and returns one of: allow, block, or manual-review.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-6",
          "recent-7",
          "recent-8"
        ],
        "quotes": [
          "Add an AI system to help with moderation that blocks illegal content",
          "yes, hate speech, underage content threats copyrigh. community only",
          "Underage block entirely, hate speech borderline cases manual copyright block fully, and a message that the upload was blocked for violating guidelines?"
        ]
      },
      "acceptanceCriteria": [
        "Creating a Community Board post runs moderation before persisting the post.",
        "The moderation implementation uses local heuristics/rules only (no calls to third-party AI services).",
        "Moderation evaluates at minimum: hate speech, underage content, threats, and copyright indicators from the user-provided text fields."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enforce moderation outcomes on Community Board uploads with the specified policy: underage content must be blocked entirely; copyright violations must be blocked entirely; borderline hate speech cases must be routed to manual review (not published in the public feed).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-7"
        ],
        "quotes": [
          "Underage block entirely, hate speech borderline cases manual copyright block fully, and a message that the upload was blocked for violating guidelines?"
        ]
      },
      "acceptanceCriteria": [
        "Underage-detected posts are rejected and are not saved.",
        "Copyright-detected posts are rejected and are not saved.",
        "Borderline hate-speech-detected posts are not shown in listPosts/getPostsWithCounts until approved.",
        "Approved posts appear normally in the public feed and behave like existing posts."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a moderation review queue for Community Board content that is routed to manual review, including backend methods for admins to list pending items and to approve or reject them.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-7"
        ],
        "quotes": [
          "hate speech borderline cases manual"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes admin-only APIs to: list pending moderation items; approve an item (publish it); reject an item (discard it).",
        "Non-admin callers attempting to access moderation-queue APIs receive an authorization error.",
        "Frontend provides an admin-only UI section on the Community Board page to view pending items and approve/reject them.",
        "Approving publishes the post to the standard feed; rejecting prevents it from appearing and removes it from the pending list."
      ]
    },
    {
      "id": "REQ-4",
      "text": "When an upload is blocked by moderation, show the user a clear error message stating that the upload was blocked for violating guidelines.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7"
        ],
        "quotes": [
          "and a message that the upload was blocked for violating guidelines?"
        ]
      },
      "acceptanceCriteria": [
        "If createPost fails due to moderation block, the UI shows an English message indicating the upload was blocked for violating guidelines.",
        "The blocked message is shown using the existing error/toast pattern in CommunityBoardPage.",
        "Other backend errors continue to be normalized via existing normalizeActorError behavior."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update frontend actor error normalization to recognize moderation-related backend errors (blocked vs. manual review) and present user-friendly English messaging without exposing internal details.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7"
        ],
        "quotes": [
          "and a message that the upload was blocked for violating guidelines?"
        ]
      },
      "acceptanceCriteria": [
        "Moderation block errors are normalized to an English message that matches the requested wording.",
        "Manual-review submission (if implemented as a successful submission or distinct error) is communicated in a user-friendly way (e.g., indicates it is pending review).",
        "No raw Motoko Runtime.trap strings or internal codes are shown to end users for moderation outcomes."
      ]
    }
  ],
  "constraints": [
    "Apply moderation only to Community Board uploads/posts (not site-wide).",
    "Do not use external AI services or third-party moderation APIs; moderation must run entirely within the Internet Computer canister/frontend logic.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit files under frontend/immutablePaths (must compose existing UI components instead).",
    "All user-facing text must be English."
  ],
  "nonGoals": [
    "Building real-time moderation pipelines (no websockets/streaming analysis).",
    "Moderating content outside the Community Board feature.",
    "Implementing third-party copyright fingerprinting or external media scanning services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}