{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix profile creation navigation and edit-mode flow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make “Create My Public Profile” reliably navigate authenticated users to their own profile route in edit mode from the empty directory state.",
      "acceptanceCriteria": [
        "When the profiles directory is empty and the user is authenticated, clicking “Create My Public Profile” navigates to `/profiles/<callerPrincipal>?edit=true`.",
        "If the user is not authenticated, the UI continues to show a sign-in call-to-action instead of attempting navigation.",
        "No console errors occur when clicking the button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilesDirectoryPage.tsx",
          "operation": "modify",
          "description": "Harden the empty-state CTA by (1) ensuring the directory page does not render the authenticated “Create My Public Profile” action until Internet Identity auth state is ready and the principal can be read safely, and (2) using a single, consistent navigation call that targets `/profiles/$principal` with `search: { edit: true }` using the caller principal string. Use the existing Internet Identity auth state (authorization component guidance) to gate navigation; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show the profile creation form immediately on the profile page when visiting own profile with `edit=true` and no profile exists.",
      "acceptanceCriteria": [
        "Given an authenticated user with no saved profile, visiting `/profiles/<callerPrincipal>?edit=true` renders the profile editor form (EditProfilePanel) directly.",
        "The “Create Your Profile” empty state is only shown when `edit` is not set (or is false)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Update the edit-mode logic to be URL-driven and render-stable: when `search.edit` is true and the viewer is the authenticated owner, render `EditProfilePanel` immediately even if the profile query returns null (first-time creation). Only show the “Create Your Profile” empty state when the profile is missing AND `edit` is not set/false. Use the existing Internet Identity auth state (authorization component guidance) to determine `isOwnProfile`; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "After creating a profile successfully, redirect to the non-edit profile view and show the newly saved content without refresh.",
      "acceptanceCriteria": [
        "After a successful save from the creation form, the route becomes `/profiles/<callerPrincipal>` (no `edit=true` in the URL).",
        "The saved profile content is displayed on the profile page immediately after redirect (no manual refresh required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profiles/EditProfilePanel.tsx",
          "operation": "modify",
          "description": "After a successful save, ensure the app transitions to view mode and displays fresh data: refetch/refresh the relevant React Query caches (caller profile + profile page for caller principal) before invoking `onClose()` so that `ProfilePage` can immediately render the saved profile after navigation clears `edit=true`. Use the existing Internet Identity auth state (authorization component guidance) to resolve the caller principal for targeted refetching; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useProfileQueries.ts",
          "operation": "modify",
          "description": "Strengthen post-save cache behavior to prevent stale null profile reads after creation: on successful `saveCallerUserProfile`, explicitly refresh or set query data for the caller’s profile page query key(s) in addition to invalidation so that `/profiles/<callerPrincipal>` renders populated data immediately after redirect. Verify the component's usage instructions for authorization before implementing."
        }
      ]
    }
  ]
}