{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Community Board moderation UX: blocked messaging + admin review queue",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add an admin-only moderation review queue UI on the Community Board page to list pending items and approve/reject them.",
      "acceptanceCriteria": [
        "Frontend provides an admin-only UI section on the Community Board page to view pending items and approve/reject them.",
        "Approving publishes the post to the standard feed; rejecting prevents it from appearing and removes it from the pending list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks/mutations for moderation queue operations using existing actor methods (getModerationQueue, approveModerationRequest, rejectModerationRequest), including cache invalidation for the public posts feed and the queue after actions."
        },
        {
          "path": "frontend/src/components/community/ModerationQueuePanel.tsx",
          "operation": "create",
          "description": "Create an admin-only ModerationQueuePanel component that renders pending moderation items with approve/reject actions and appropriate loading/empty/error states. Use shadcn-ui components (e.g., Card, Button, Alert) for consistent UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CommunityBoardPage.tsx",
          "operation": "modify",
          "description": "Wire ModerationQueuePanel into the CommunityBoardPage with an admin-only guard (based on the existing useIsCallerAdmin hook) so non-admin users never see the queue UI. Ensure actions trigger refetch/invalidation so approvals appear in the standard feed and rejections disappear from the queue."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Show a clear toast/error message when a Community Board upload is blocked by moderation.",
      "acceptanceCriteria": [
        "If createPost fails due to moderation block, the UI shows an English message indicating the upload was blocked for violating guidelines.",
        "The blocked message is shown using the existing error/toast pattern in CommunityBoardPage.",
        "Other backend errors continue to be normalized via existing normalizeActorError behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommunityBoardPage.tsx",
          "operation": "modify",
          "description": "Ensure post submission continues to surface moderation-block failures via the existing toast.error(normalizeActorError(error)) pattern, without exposing internal details, and without changing non-moderation error handling."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Normalize moderation-related backend errors into user-friendly English messages for blocked vs manual-review outcomes.",
      "acceptanceCriteria": [
        "Moderation block errors are normalized to an English message that matches the requested wording.",
        "Manual-review submission (if implemented as a successful submission or distinct error) is communicated in a user-friendly way (e.g., indicates it is pending review).",
        "No raw Motoko Runtime.trap strings or internal codes are shown to end users for moderation outcomes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/actorError.ts",
          "operation": "modify",
          "description": "Extend normalizeActorError() to detect moderation-related failures and map them to user-friendly English messages: (1) blocked: \"The upload was blocked for violating guidelines.\" (2) manual review: a message indicating the submission is pending review. Ensure sanitized output and no raw trap strings/codes are exposed."
        },
        {
          "path": "frontend/src/pages/CommunityBoardPage.tsx",
          "operation": "modify",
          "description": "Adjust success/error toast messaging around post submission to clearly communicate moderation outcomes based on normalized messages (e.g., blocked vs pending review) while preserving existing normalizeActorError usage for all other errors."
        }
      ]
    }
  ]
}