{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Gallery mixed media uploads (images + videos) with mixed feed and lightbox support",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Enable authenticated users to upload images/videos to the Gallery and render uploaded items mixed with existing static items while preserving search and favorites.",
      "acceptanceCriteria": [
        "/gallery includes an upload entry point (e.g., button opening a dialog/panel) that is only enabled/visible for authenticated users; anonymous users see a clear prompt to sign in to upload.",
        "The upload UI accepts both image and video files and validates files using the existing utilities (frontend/src/utils/imageAttachment.ts and frontend/src/utils/videoAttachment.ts), showing user-friendly validation errors.",
        "After a successful upload, the newly uploaded item appears in the gallery grid without a full page refresh (React Query cache invalidation/refetch).",
        "The gallery grid renders a mixed list of items (existing static items plus uploaded items) together in one feed; search and favorites filtering continue to work on the combined list.",
        "Favorites functionality works for both static and uploaded items (no ID collisions; favorites persist in localStorage)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGalleryFavorites.ts",
          "operation": "modify",
          "description": "Update gallery favorites to store stable string IDs (e.g., namespaced like \"static:<id>\" and \"uploaded:<derived>\") to prevent collisions between static and uploaded items while keeping localStorage persistence."
        },
        {
          "path": "frontend/src/utils/galleryMedia.ts",
          "operation": "create",
          "description": "Add shared types and helpers for the mixed gallery feed: normalize static items + backend GalleryMediaItem into a unified UI model, derive stable unique string IDs for uploaded items, and provide search/favorites filter helpers."
        },
        {
          "path": "frontend/src/hooks/useGalleryMediaQueries.ts",
          "operation": "create",
          "description": "Create React Query hooks to (1) list uploaded gallery media items from the backend actor and (2) upload a new gallery media item, invalidating/refetching the gallery query on success. Use the core-infrastructure actor wiring via useActor, and handle authorization failures using normalizeActorError. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/gallery/GalleryUploadDialog.tsx",
          "operation": "create",
          "description": "Implement an upload dialog/panel composed from existing shadcn-ui components (do not modify ui primitives). The dialog should accept a single file (image or video), validate using imageAttachment/videoAttachment utilities, show user-friendly errors, and on submit create a blob-storage ExternalBlob from the selected file bytes and call the upload mutation hook. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/GalleryPage.tsx",
          "operation": "modify",
          "description": "Integrate uploaded media into /gallery: fetch uploaded items via the new query hook, merge with existing static gallery items into one mixed list, keep search and favorites filtering on the combined list, and wire the GalleryUploadDialog as an upload entry point. Show the upload control only when authenticated via existing Internet Identity state; otherwise show a clear English sign-in prompt and a sign-in button that uses the existing authentication hook. Ensure new uploads appear without full refresh by relying on React Query invalidation/refetch. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Extend the gallery lightbox to display either images or videos with accessible controls and keyboard navigation across a mixed media list.",
      "acceptanceCriteria": [
        "Clicking an image item opens the existing lightbox with the image displayed as before.",
        "Clicking a video item opens a lightbox that plays the video with standard controls (play/pause/seek/volume) and does not autoplay by default.",
        "Previous/Next navigation works across the mixed media list (images and videos) using both on-screen buttons and ArrowLeft/ArrowRight keys; Escape closes the lightbox.",
        "The lightbox remains accessible: focus is managed on open/close, controls have appropriate aria-labels, and the overlay can be closed reliably."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/gallery/GalleryLightbox.tsx",
          "operation": "modify",
          "description": "Generalize the lightbox props from image-only to mixed media (image/video): render an image element for images and a video player for videos (controls enabled, autoplay disabled), keep existing focus management and overlay click-to-close behavior, and ensure aria-labels/keyboard navigation remain correct for mixed lists."
        },
        {
          "path": "frontend/src/pages/GalleryPage.tsx",
          "operation": "modify",
          "description": "Update item click handling and the lightbox invocation so it passes the selected mixed-media item (image/video) from the combined feed, ensuring Previous/Next navigation traverses the same mixed list used to render the grid."
        }
      ]
    }
  ]
}