{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Plushie Pal — Scripted Plushie Assistant Chat (On-device)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a dedicated Plushie Assistant chat page and wire it into TanStack Router and main navigation (no external AI).",
      "acceptanceCriteria": [
        "A new route exists (e.g., \"/assistant\") and is registered in the TanStack Router route tree.",
        "The main site navigation includes a new link labeled \"Assistant\" (or \"Plushie Assistant\") that navigates to the assistant page.",
        "The assistant page renders a chat UI with: message list, a text input, and a send button; pressing Enter sends the message.",
        "All user-facing strings on the assistant page are in English.",
        "No network calls to external AI services are made from this feature."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PlushieAssistantPage.tsx",
          "operation": "create",
          "description": "Create the new \"Plushie Assistant\" page with a scripted/on-device chat UI (message transcript, input, Send button, Enter-to-send). Use shadcn/ui primitives (e.g., Card, Button, Input/Textarea, Separator) to match existing styling conventions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new \"/assistant\" route in the TanStack Router route tree and import/render the new PlushieAssistantPage component."
        },
        {
          "path": "frontend/src/components/Nav.tsx",
          "operation": "modify",
          "description": "Add a new navigation link labeled \"Assistant\" (or \"Plushie Assistant\") pointing to \"/assistant\" in both desktop and mobile navigation lists."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement scripted plushie-themed conversation logic (facts/care, recommendations, short stories, consistent personality) with quick-action intent chips.",
      "acceptanceCriteria": [
        "The assistant supports at least these intents: facts/care Q&A, recommendations, story generation, and general friendly chat/personality responses.",
        "The assistant offers quick-action prompt chips/buttons for the main intents (e.g., \"Care tips\", \"Recommend a plushie\", \"Tell me a story\").",
        "Recommendations ask at least 2 preference questions (e.g., size, texture, animal type, budget) before suggesting options.",
        "Story generation produces a coherent short story (at least ~5 sentences) with plushie-themed tone and optionally asks for a character name/theme to personalize it.",
        "The assistant personality remains consistent across responses (warm, cozy, plushie-themed), without claiming to be a real AI model or using external data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/plushieAssistant.ts",
          "operation": "create",
          "description": "Implement on-device scripted conversation logic: intent detection/routing (facts/care, recommendations, story, friendly chat), a lightweight session state machine for multi-turn flows (recommendation preferences + story personalization), and deterministic response generation with a consistent plushie-themed personality. Ensure the module makes no network calls."
        },
        {
          "path": "frontend/src/pages/PlushieAssistantPage.tsx",
          "operation": "modify",
          "description": "Connect the UI to the scripted logic (no external AI): render quick-action prompt chips/buttons for the main intents, route user input through plushieAssistant logic, and display assistant responses in a chat transcript using existing shadcn/ui components. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add chat UX safeguards: block empty input with English feedback, persist chat history in localStorage, provide Clear chat with confirmation, and handle long transcripts smoothly.",
      "acceptanceCriteria": [
        "Sending an empty/whitespace-only message is blocked with an inline validation message or toast in English.",
        "Chat history persists across page reloads using on-device storage (e.g., localStorage) and can be cleared by a \"Clear chat\" button with a confirmation step.",
        "The UI handles long messages gracefully (wrapping, scrollable transcript) and keeps the latest message visible after sending.",
        "No backend schema changes or backend calls are required for chat history persistence."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAssistantChat.ts",
          "operation": "create",
          "description": "Create a hook to manage assistant chat state on-device: message list, session state for scripted flows, localStorage hydration/persistence, helpers to send messages, and a clear-history method. Ensure persistence is strictly local (no backend calls)."
        },
        {
          "path": "frontend/src/pages/PlushieAssistantPage.tsx",
          "operation": "modify",
          "description": "Add UX safeguards and state handling: prevent empty/whitespace send with an English toast/inline message (use existing sonner toast pattern), add a \"Clear chat\" action with a confirmation step (native confirm or existing dialog patterns), make transcript scrollable with wrapped long messages, and auto-scroll to latest message after sending. Use shadcn/ui components for buttons/layout where applicable. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}