{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend: One-time admin claim UI + updated backend bindings",
  "requirements": [
    {
      "id": "REQ-91",
      "summary": "Update AuthControls admin-claim UI to call the backend one-time claim method, refresh cached admin status, and show clear English toasts for success/failure including actor-not-ready.",
      "acceptanceCriteria": [
        "Clicking the \"Claim Admin\" menu item successfully calls the backend admin-claim method for the signed-in user.",
        "On success, the UI shows a success toast in English (e.g., \"You are now an admin.\") and invalidates/refetches the ['isAdmin'] query so admin-only controls appear without a page reload.",
        "If admin was already claimed (or the user is not eligible), the UI shows a clear English error toast (e.g., \"Admin access has already been claimed on this canister.\") rather than a technical error.",
        "If the actor is not ready, the UI shows an English message (existing or updated) indicating the system is still connecting."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthControls.tsx",
          "operation": "modify",
          "description": "Replace the current role-assignment call with the backend one-time admin claim call (actor.claimAdmin()). On success, show an English success toast and invalidate/refetch the React Query ['isAdmin'] query. If actor is not available, show an English 'still connecting' message instead of proceeding. Ensure all user-facing strings remain English."
        },
        {
          "path": "frontend/src/utils/actorError.ts",
          "operation": "modify",
          "description": "Add/adjust error normalization so admin-claim failures (e.g., admin already claimed / not eligible) map to clear, non-technical English messages suitable for toasts, while preserving the existing 'still connecting' handling for actor readiness errors."
        }
      ]
    },
    {
      "id": "REQ-92",
      "summary": "Update generated frontend backend bindings/types so the frontend can type-check when calling isCallerAdmin() and the new claimAdmin() method.",
      "acceptanceCriteria": [
        "Type-check/build succeeds with the frontend calling actor.isCallerAdmin() from frontend/src/hooks/useQueries.ts.",
        "Type-check/build succeeds with the frontend calling the backend admin-claim method from frontend/src/components/AuthControls.tsx."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the backend interface type definitions to include the admin-claim method signature (claimAdmin(): Promise<void>) and ensure isCallerAdmin(): Promise<boolean> remains correctly typed, so AuthControls.tsx and useQueries.ts compile without type errors."
        }
      ]
    }
  ]
}