{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add uploaded coloring pages to the static Coloring Book PDF",
  "requirements": [
    {
      "id": "REQ-60",
      "summary": "Update the static `/assets/coloring-book.pdf` to include the two uploaded PNGs as additional high-contrast black-and-white coloring pages suitable for letter/A4 printing.",
      "acceptanceCriteria": [
        "Visiting `/assets/coloring-book.pdf` in the browser successfully loads a PDF (HTTP 200) in a deployed build.",
        "The PDF contains two additional pages that match the uploaded images (bear plush line art and the creature with hat/flowers line art).",
        "The added pages are high-contrast black line art on white background with no unintended background tinting or compression artifacts that make lines blurry when printed.",
        "The Home page download button continues to open the updated PDF in a new tab via the existing link `/assets/coloring-book.pdf`."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/coloring-book.pdf",
          "operation": "modify",
          "description": "Replace/update the static coloring book PDF so it includes two new pages derived from the existing static asset PNGs `frontend/public/assets/colorifyai-1770544927646.png` and `frontend/public/assets/colorifyai-1770544979559.png`, ensuring clean black line art (no unexpected color fills), white background, and letter/A4-friendly page sizing for crisp printing."
        }
      ]
    },
    {
      "id": "REQ-61",
      "summary": "Commit the two uploaded PNG source images into frontend static assets without changing filenames.",
      "acceptanceCriteria": [
        "Both PNG files are present in the deployed frontend static files and can be fetched directly by the browser at their committed static-asset paths.",
        "The committed filenames exactly match: `colorifyai-1770544927646.png` and `colorifyai-1770544979559.png`."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/colorifyai-1770544927646.png",
          "operation": "create",
          "description": "Add the original uploaded bear plush line-art PNG to frontend static assets, preserving the exact filename for direct browser fetch."
        },
        {
          "path": "frontend/public/assets/colorifyai-1770544979559.png",
          "operation": "create",
          "description": "Add the original uploaded creature-with-hat/flowers line-art PNG to frontend static assets, preserving the exact filename for direct browser fetch."
        }
      ]
    }
  ]
}