{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add allowlisted YouTube/Vimeo video embeds to LinkifiedText",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Extend LinkifiedText token parsing/rendering to auto-embed responsive players for allowlisted YouTube/Vimeo URLs while keeping all other URLs as external links.",
      "acceptanceCriteria": [
        "When a user includes a YouTube or Vimeo URL in post titles, post bodies, or comment content, the UI renders an embedded video player for that URL.",
        "Non-video URLs continue to render as clickable links (open in a new tab) exactly as they do today.",
        "Embeds are implemented using a strict allowlist of video providers (e.g., YouTube/Vimeo) and do not allow arbitrary iframe embedding.",
        "Embedded players are responsive (maintain aspect ratio and fit the container on mobile/desktop)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/videoEmbeds.ts",
          "operation": "create",
          "description": "Add allowlist-based helpers to detect supported video URLs (minimum YouTube and Vimeo) and convert them into safe embed descriptors (provider + canonical embed URL + optional video id), ensuring only known embed hostnames are produced."
        },
        {
          "path": "frontend/src/utils/linkifyText.ts",
          "operation": "modify",
          "description": "Extend the existing tokenization to emit a distinct token type for supported video URLs using a strict allowlist (via the new video embed helpers); keep existing behavior for all other URLs (still emitted as link tokens)."
        },
        {
          "path": "frontend/src/components/community/VideoEmbed.tsx",
          "operation": "create",
          "description": "Create a dedicated, responsive VideoEmbed component that renders an iframe only from allowlisted providers (YouTube/Vimeo) and maintains aspect ratio across mobile/desktop without using dangerouslySetInnerHTML."
        },
        {
          "path": "frontend/src/components/community/LinkifiedText.tsx",
          "operation": "modify",
          "description": "Update LinkifiedText to render the new video tokens with the VideoEmbed component and continue rendering non-video URL tokens as external links (target=_blank, rel=noopener noreferrer); adjust the wrapper element as needed to safely support block embeds while preserving whitespace."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure video-embed rendering applies consistently everywhere LinkifiedText is used (CommunityBoardPage post title/body and PostComments comment content).",
      "acceptanceCriteria": [
        "CommunityBoardPage renders video embeds in post titles and post bodies where applicable.",
        "PostComments renders video embeds in comment content where applicable.",
        "No changes are required to backend data structures or APIs to support video embedding (embeds are derived from existing text content)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommunityBoardPage.tsx",
          "operation": "modify",
          "description": "Adjust post title/body rendering as needed to accommodate block-level video embeds produced by LinkifiedText (e.g., avoid placing embed-capable content inside a heading element that only allows phrasing content) while keeping existing UI behavior for non-video links."
        },
        {
          "path": "frontend/src/components/community/PostComments.tsx",
          "operation": "modify",
          "description": "Confirm/adjust comment content layout so LinkifiedText-rendered video embeds display correctly and responsively within the comment container, without changing comment submission/loading behavior."
        }
      ]
    }
  ]
}