{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Community Board: Fix image upload submission + feed rendering",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Send selected Community Board image bytes to backend by constructing an ExternalBlob and passing it into createModerationRequest.",
      "acceptanceCriteria": [
        "When an image is selected in CommunityBoardPage, the create-post mutation sends it to the backend (not ignored).",
        "Creating a post without an image continues to work (sends null/undefined appropriately)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useCreatePost to construct an image blob using the blob-storage ExternalBlob helper (ExternalBlob.fromBytes(...)) and call createModerationRequest(title, body, video, image). Ensure null is passed when no imageBytes are provided. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Display approved post image attachments in the Community Board feed using PostImageAttachment when post.image is present.",
      "acceptanceCriteria": [
        "In CommunityBoardPage, posts that include an image render an inline image attachment using PostImageAttachment.",
        "Posts without an image render exactly as before (no broken image UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/community/PostImageAttachment.tsx",
          "operation": "modify",
          "description": "Update PostImageAttachment to accept the backend-provided image ExternalBlob and render it using its direct URL (ExternalBlob.getDirectURL()) so images stream/cache correctly via blob-storage. Keep null-safe behavior (render nothing if missing). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CommunityBoardPage.tsx",
          "operation": "modify",
          "description": "Wire PostImageAttachment into the posts feed by conditionally rendering it when post.image is present (alongside existing video attachment rendering), ensuring layout remains unchanged for posts without images."
        }
      ]
    }
  ]
}